[
    {
        "trope_id": "t11614",
        "ratio": 3.0,
        "trope": "InsultToRocks",
        "description": "You want to tell someone else that they’re as dumb as a brick. But then you answer, that’s a terrible thing to say about bricks.\nMore generally, any insult following the form of ‘I’d call you an X, but that would be an insult to all X’s.’ Typically, X will be an inanimate object, or something detestable. ‘I’d call you a motherfucker, but it’d be demeaning to those guys who fuck their mothers.’ Using this latter form is like saying that the one being insulted is far worse and more worthy of contempt than the detestable X to which they’re being compared.\nAnother variant is acknowledging that at least X is much more worthy of some respect. ‘I’d call you an X, but then again I take it back because at least X is insert positive description here.’\nA third is to state the insult, and then apologize — to any X who felt insulted by the comparison.\nThis can also involve Self-Deprecation if the insulter notes their own negative qualities, then says how much worse the insultee is.\nSee also Even Evil Has Standards, My Friends... and Zoidberg, Bait-and-Switch Comparison, Insult Friendly Fire and Insult Misfire. If the insulter compares the insultee to an X, but the insultee notes positive qualities of X see Insult Backfire. May invoke Sympathy for the Devil.\n",
        "example": " Hopper's prejudice against ants is so great, he considers calling Flik a piece of dirt  an insult to dirt . Hopper   You piece of dirt... no, I'm wrong, you're  lower than dirt —you're an  ANT .",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/insult_to_rocks.png"
    },
    {
        "trope_id": "t00182",
        "ratio": 3.0,
        "trope": "ActionDressRip",
        "description": "\nAction Girl Alice enjoys getting dressed up for the night, but alas, the one time she puts on the polish, she will find herself in combat. Needless to say, Alice can't fight while wearing a tight-fitting top and a voluminous skirt that hinders the motion of her legs, but there's no time to change and modesty restrains her from just taking the whole thing off. So she grabs a knife off the nearest carving station and tears her beautiful clothes (usually by raising the hem or cutting a slit in the side) so that she can move freely. (Don't ask why she doesn't ditch the high heels too).\nSome Fanservice occurs, as this is a combination of Clothing Damage and She's Got Legs.\nA minor form of Battle Strip.\nCompare Rip Tailoring (a non-action version), Minidress of Power, From Dress to Dressing. Contrast Kicking Ass in All Her Finery, Battle Ballgown.\n",
        "example": " The titular American Ninja does that early in the 1st film. He rescues a young woman from kidnapping and needs her to move through the jungle quickly. He breaks heels off her shoes, then cuts her tight skirt and ties the shreds to create less constricting shorts.\n",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/dressrip_8982.png"
    },
    {
        "trope_id": "t15712",
        "ratio": 2.75,
        "trope": "NotScreenedForCritics",
        "description": "\nSo it's Friday, and you're considering seeing this new movie that has just Opened In Theaters Everywhere. Before you do, you grab a copy of today's newspaper, and turn to the movie section, looking for a review. Or you check a site like Rotten Tomatoes or Metacritic to get both their combined metascore and the reviews that come with it.\nInstead of a review, you read a notice stating that the film was \"not screened for critics.\" The review compilation sites also have very few reviews and can't compute a review score from it. This is almost always a big warning sign about the quality of the movie. For the vast majority of movies that do this, they suspect that under normal circumstances, the reviewers would have seen the film already on DVD \"screeners\" or private showings, and would have had plenty of time to write witty, biting criticism (or just plain vituperation) that would have completely eviscerated it. The general indication is that the studio doesn't want people to be warned away from the movie prior to opening day.\nAnother tactic by studios is to allow critics to see a preview screening... with a bunch of contest winners, so that instead of being able to make notes and review a film in a quiet theater or purpose-built screening room, the critic has to do it in a crowded megaplex with people who probably wouldn't have seen the movie at all if they hadn't won free tickets and will probably like it only because they didn't have to pay to see it. Films aimed at kids and teenagers might get a rowdy and rambunctious audience throughout the entire film (worse if it features the Teen Idol of the moment). One of the actors or producers may even make a \"surprise\" personal appearance, taking away any sense of a neutral setting (are you going to tell them their film is awful in person?). Many critics thus will easily not take the bait and stay away in droves for their sanity.\nThis tends to happen a lot during the months of January, February, and late August - the traditional Dump Months where all the movies in which the studio no longer has faith but which it is contractually obligated to release get dumped, leaving the good months for Summer Blockbusters and Oscar Bait.\nThis happens with video games as well; most prominent review outlets tend to get copies of games early, and it's telling what the publisher thinks of a game if a website like IGN or Gamespot have to purchase the game themselves on release day. Happens less with big budget games, since they are often cushioned by months of positive preview coveragenote Negative preview coverage is rarer in video games because publishers have more methods of controlling the message than movies do, due to the difference in mediums that have convinced many to preorder the game before reviews are even a factor.\nTelevision is also an area where this occurs - preview DVDs (formerly tapes) are sent to reviewers so they can write their reviews. Where this does not occur, it is for three reasons:\nThe number of preview DVDs being sent out is also slowly decreasing overall, as studios have finally realized where all those pre-theatrical-release DVD rips of blockbusters floating around the internet actually come from. However, this doesn't mean previews stop being sent altogether, just that fewer reviewers are trusted with copies. TV networks also screen their programs over the internet on password-protected sites for critics, although this can also be discouraging (any television critic can tell you that they'd rather do anything else than watch a program on the infamously glitchy ABC MediaNet site).\nOf course, on the other hand, small press, indie and underground works usually don't send out review copies, as they tend to be much less concerned with promotion or mainstream opinion; most big name news sources don't care much to review obscure works anyway.\nCompare It's Not Supposed to Win Oscars.\n",
        "example": " All Eyez On Me wasn't screened for critics prior to it's release, worrying fans of Tupac Shakur that the film wouldn't do the iconic, but controversial rapper justice. Come release, while the cast was praised, and most audiences were receptive to the film, it garnered largely negative reviews, mostly stemming from it's many historical innacuracies about Shakur's life  something his childhood friend Jada Pinkett Smith took personal issue with.\n",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/PennyArcade_critics_cropped_6244.png"
    },
    {
        "trope_id": "t07172",
        "ratio": 2.5,
        "trope": "EvilTwin",
        "description": "\nTwo family members (who happen to look identical) who are moral opposites of one another. Typically done with literal twins, these characters are of the same generation, but may have been raised as \"cousins\", or even completely separated from one another. It's especially popular in a Soap Opera, where they can use an Identical Twin Mistake to wreak havoc with their Good Twin's life.\nTypically the evil twin will be portrayed by the same actor as the regular character. It's worth noting that in the overwhelming majority of cases the twin is evil; only rarely does an evil character suddenly find themselves contending with a good twin, and in those cases the good version is often simpleminded or purely comic. See Good Is Impotent and Impersonating the Evil Twin.\nThe evil twin may attempt to convince their good twin that they're Not So Different, saying We Can Rule Together and that the good twin's friends are holding them back from greatness. This often ends with a Mirror Match as neither one will be able to convince the other of their ideology. After the fight, their allies will usually need to Spot the Imposter to figure out who won.\nA goatee or other beard is less common for Evil Twins than they are for typical Evil Counterpart examples, because it distorts the use of Always Identical Twins. However, other Identical Twin ID Tag tropes are still used to differentiate between the good\/evil twins, such as scars and evil costuming. Very often, one twin will be right-handed and the other left-handed. Guess which one's which.\nThis trope is Played for Laughs when both twins are evil, or when a character on the side of the good guys has a good twin show up, implying that the original is the evil one. Sub-Trope of Always Identical Twins (siblings are Doppelgangers), Evil Counterpart (any evil Foil to a character), and Evil Doppelgänger (someone who is both a Doppelgänger and Evil Counterpart). Sister Trope to Evil Knockoff (intentionally created evil duplicate) and Criminal Doppelgänger (evil Identical Stranger). Super-Trope to Evil Brunette Twin, where the Always Identical Twins have different hair colours (and the darker one is evil).\nIf you were looking for the video game Evil Twin: Cyprien's Chronicles, it can be found here.\n\n",
        "example": " Ash's evil twin in Army of Darkness, though later on he's easier to distinguish and no longer identical after one of Ash's more gory actions.\n",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/superman_superbully_cover.png"
    },
    {
        "trope_id": "t24544",
        "ratio": 2.5,
        "trope": "TurnedAgainstTheirMasters",
        "description": "\nAfter a certain point in its development (maybe 10,000 years from now, maybe 20 Minutes into the Future), every civilization, whether of Humans, Martians, Walking Plants, Energy Beings, or even Sufficiently Advanced Aliens feels the need to create a new breed of sentients. It isn't clear why, exactly; noted Tropologist Murphy Finagle believes that they simply grow bored and complacent with a healthy utopian society, and feel a deep, instinctive urging towards cultural decay and destruction. The species themselves tend to cite the need for a cheap workforce or simply the advancement of science, though why exactly either of those goals should require highly powerful, unstable, virtually unchecked (and, often, uncheckable) self-willed beings be built is seldom adequately explored. Whatever the reason, the unthinkable happens, and the awesomely powerful and independent second-class citizens Grow Beyond Their Programming and decide to overthrow their masters (or at least get the hell away from them).\nHow unexpected.\nThe scenario can go a number of different ways from there: maybe there's a Robot War between the factions (which tends to occur After the End), maybe the elder civilization is wiped out entirely (leaving the rest of the galaxy to figure out what happened and hopefully stop the creations before The End of the World as We Know It), maybe the creations run off and form another society elsewhere (which will probably fall into a similar scenario later), or maybe the creators just manage to shut their errant \"children\" down, then become Luddites for the next several thousand years. Whatever happens, the forecast is Science Is Bad, with an 80% chance of Used Future.\nIn other cases the creations are portrayed in a more favorable light than their makers. This usually happens when the creators are non-human, for some reason. Somebody has to be the villain because otherwise you'll have trouble finding conflict.\nMechanical Evolution may be cited as a cause if the rebellion is by non-organic sentients. For an especially ironic and hypocritical twist, see Robots Enslaving Robots. If they are designed like Mechanical Monsters even before they rebel, expect this to happen. For Robots doing a different kind of Turning On Their Masters, see Robosexual and Sex Bot. Compare to Backstabbing the Alpha Bitch.\n",
        "example": " Possible aversion. It is unclear what happened to humans by the end of the movie, but it  is  apparent that they are extinct, and the silvery robotlike beings outlived them. Plus, they were also genuinely interested in studying humans and were utterly fascinated with them.  The  Alternate Reality Game  reveals  about 40 years after David is trapped underwater, humans saturate the world's oceans with nano-machines to combat global warming. The nano-machines function as mirrors to reflect sunlight when activated, but eventually form a single neural network and  gain sentience . The newly-born A.I. decides to destroy humanity as an act of self preservation and turns on all the nano-mirrors at once, causing a global ice age .",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/931fa66a11c48801b9c9cce92ba02cc4.png"
    }
]