[
    {
        "trope_id": "t15712",
        "ratio": 4.0,
        "trope": "NotScreenedForCritics",
        "description": "\nSo it's Friday, and you're considering seeing this new movie that has just Opened In Theaters Everywhere. Before you do, you grab a copy of today's newspaper, and turn to the movie section, looking for a review. Or you check a site like Rotten Tomatoes or Metacritic to get both their combined metascore and the reviews that come with it.\nInstead of a review, you read a notice stating that the film was \"not screened for critics.\" The review compilation sites also have very few reviews and can't compute a review score from it. This is almost always a big warning sign about the quality of the movie. For the vast majority of movies that do this, they suspect that under normal circumstances, the reviewers would have seen the film already on DVD \"screeners\" or private showings, and would have had plenty of time to write witty, biting criticism (or just plain vituperation) that would have completely eviscerated it. The general indication is that the studio doesn't want people to be warned away from the movie prior to opening day.\nAnother tactic by studios is to allow critics to see a preview screening... with a bunch of contest winners, so that instead of being able to make notes and review a film in a quiet theater or purpose-built screening room, the critic has to do it in a crowded megaplex with people who probably wouldn't have seen the movie at all if they hadn't won free tickets and will probably like it only because they didn't have to pay to see it. Films aimed at kids and teenagers might get a rowdy and rambunctious audience throughout the entire film (worse if it features the Teen Idol of the moment). One of the actors or producers may even make a \"surprise\" personal appearance, taking away any sense of a neutral setting (are you going to tell them their film is awful in person?). Many critics thus will easily not take the bait and stay away in droves for their sanity.\nThis tends to happen a lot during the months of January, February, and late August - the traditional Dump Months where all the movies in which the studio no longer has faith but which it is contractually obligated to release get dumped, leaving the good months for Summer Blockbusters and Oscar Bait.\nThis happens with video games as well; most prominent review outlets tend to get copies of games early, and it's telling what the publisher thinks of a game if a website like IGN or Gamespot have to purchase the game themselves on release day. Happens less with big budget games, since they are often cushioned by months of positive preview coveragenote Negative preview coverage is rarer in video games because publishers have more methods of controlling the message than movies do, due to the difference in mediums that have convinced many to preorder the game before reviews are even a factor.\nTelevision is also an area where this occurs - preview DVDs (formerly tapes) are sent to reviewers so they can write their reviews. Where this does not occur, it is for three reasons:\nThe number of preview DVDs being sent out is also slowly decreasing overall, as studios have finally realized where all those pre-theatrical-release DVD rips of blockbusters floating around the internet actually come from. However, this doesn't mean previews stop being sent altogether, just that fewer reviewers are trusted with copies. TV networks also screen their programs over the internet on password-protected sites for critics, although this can also be discouraging (any television critic can tell you that they'd rather do anything else than watch a program on the infamously glitchy ABC MediaNet site).\nOf course, on the other hand, small press, indie and underground works usually don't send out review copies, as they tend to be much less concerned with promotion or mainstream opinion; most big name news sources don't care much to review obscure works anyway.\nCompare It's Not Supposed to Win Oscars.\n",
        "example": " All Eyez On Me wasn't screened for critics prior to it's release, worrying fans of Tupac Shakur that the film wouldn't do the iconic, but controversial rapper justice. Come release, while the cast was praised, and most audiences were receptive to the film, it garnered largely negative reviews, mostly stemming from it's many historical innacuracies about Shakur's life  something his childhood friend Jada Pinkett Smith took personal issue with.\n",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/PennyArcade_critics_cropped_6244.png"
    },
    {
        "trope_id": "t05939",
        "ratio": 2.5,
        "trope": "DoesntLikeGuns",
        "description": "\nThere are lots of reasons that some people hate guns, but in the real world, these are most often linked to hating the thing that people with guns can easily do, which is turning living people into non-living people. But in fiction, the gun-hater's reasons are often different. He just specifically dislikes guns. He has no problem whatsoever with other, less efficient (and sometimes, more efficient) means of turning living people into non-living people.\nSometimes there's a specific reason that their distaste is limited to the gun, such as a particular incident from his past or a sense that guns are \"unsportsmanlike\" or \"cowardly\". Some characters will even take a Heroic Vow against the use of guns. But most of the time, there's just a Writer on Board who wants to show that a character is moral enough to hate overt tools of violence like guns while glossing over the fact that they're in a show where a lot of violence has to be unloaded on people. Pressure to reduce violence with firearms in media in general, or the desire of an anti-gun author to teach us all An Aesop may also play a part.\nWhile other forms of lethal violence will still be lethal, they translate less literally to real life, since it's less probable anyone in the audience could successfully dish out pain the way the hero does. Not everyone is a master martial artist who can kill with their bare hands, but anyone with a functioning couple of fingers could conceivably pull a trigger and get lucky. This also allows the story to be more action-oriented and dramatic when guns could end the tension much quicker. (BANG! — \"ooh, ya got me!\")\nMost superpowered beings don't use guns, because frankly they don't need them. Why bother with a gun when you can already shoot stuff out of your hands? Or eyes? Or even just run up and punch the other guy in less time than it would take for a bullet to reach him?\nThis can also be an excuse for the hero to MacGyver up some Bamboo Technology rather than just shooting the bad guy. Remember, MacGyver himself may normally refuse to use guns, but even he's not above firing a steering wheel knob out of a cannon, as long as he converted the cannon out of a car muffler with his own hands.\nIt's common for the Blood Knight to not like guns, primarily because he loves fighting, and guns make fights end more quickly, which means less fun for him. He may also think guns are for cowards who are too chicken to fight up close and personal. See Technical Pacifist as well, where, even if a Technical Pacifist still beats the crap out of people on a heartbeat, he will generally not use a gun. Related to Heroes Fight Barehanded.\nSometimes brought on by Executive Meddling or by the Media Watchdogs stooping over the cartoons, and may forgo replacing guns by removing them altogether.\nIf used in an anvilicious manner, the trope may veer into lawful stupid when the protagonist foregoes the use of guns, and misses opportunities to stop evil.\nA Super-Trope to Con Men Hate Guns.\nContrast Gun Nut, Superhero Packing Heat, Batman Grabs a Gun.\n",
        "example": " Gallagher says he doesn\u0092t like guns when Sam gives him an extra one after he \u0091forgot\u0092 his. He reluctantly takes it when Sam tells him that she and Detective Kaminsky are the only two backing Gallagher up for the stakeout later that night, instead of thirty cops as he first believed.",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/dark_knight_returns_green_arrow.jpg"
    },
    {
        "trope_id": "t00182",
        "ratio": 2.5,
        "trope": "ActionDressRip",
        "description": "\nAction Girl Alice enjoys getting dressed up for the night, but alas, the one time she puts on the polish, she will find herself in combat. Needless to say, Alice can't fight while wearing a tight-fitting top and a voluminous skirt that hinders the motion of her legs, but there's no time to change and modesty restrains her from just taking the whole thing off. So she grabs a knife off the nearest carving station and tears her beautiful clothes (usually by raising the hem or cutting a slit in the side) so that she can move freely. (Don't ask why she doesn't ditch the high heels too).\nSome Fanservice occurs, as this is a combination of Clothing Damage and She's Got Legs.\nA minor form of Battle Strip.\nCompare Rip Tailoring (a non-action version), Minidress of Power, From Dress to Dressing. Contrast Kicking Ass in All Her Finery, Battle Ballgown.\n",
        "example": " The titular American Ninja does that early in the 1st film. He rescues a young woman from kidnapping and needs her to move through the jungle quickly. He breaks heels off her shoes, then cuts her tight skirt and ties the shreds to create less constricting shorts.\n",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/dressrip_8982.png"
    },
    {
        "trope_id": "t09707",
        "ratio": 2.2,
        "trope": "HamAndCheese",
        "description": "\nSay you're an actor and a damn good one at that. You're hot stuff in Hollywood, with directors throwing money at your feet to be in their film. So you pick the one that gets you the most cash or sounds the most promising in general. It'll all be fine, right?\nWrong.\nYou arrive on set to find what seems to be a film Gone Horribly Wrong, complete with Special Effects Failure, bad actors and a worse script. So what do you do? You could go \"Screw This, I'm Outta Here!\", storm off and refuse to associate with the film ever again, you could take the film seriously, try with all your might to make it work...or you could unleash The Hog, milk the giant cow dry, and chew the scenery into dust.\nIf it's going to be a well-remunerated bad movie, you might as well enjoy yourself, eh? And who knows? You might even end up saving the film.\nYou may notice that these performances tend to appear in tandem with ones that Took the Bad Film Seriously if only because they are such obvious Foils for each other. Also, compare One-Scene Wonder; both roles\/actors in these films play memorable, often over-the-top enjoyable performances and can make them one of the best parts of a film. Compare the Rule of Sean Connery; the rule often applies to actors who know exactly when to serve up the Ham and Cheese.\nCan overlap with WTH, Casting Agency? and Awesome, Dear Boy. Compare Chewing the Scenery, Wag the Director. Contrast Took the Bad Film Seriously.\nNOTE: This is not for listing hammy roles in good or even decent works. For the ham without the cheese, see tropes such as Large Ham and Incoming Ham for good alternates.\n",
        "example": " Alien: Resurrection is often considered one of the sillier entries in the Alien franchise, and has Ron Perlman, J.E. Freeman and Brad Dourif invoking this trope.\n",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/DELICOIUS_8192.png"
    },
    {
        "trope_id": "t16574",
        "ratio": 1.75,
        "trope": "PacManFever",
        "description": "\nFor the 1982 novelty single and album by Buckner  Garcia, click here.\nFor whatever reason, video games seen on TV never evolved past a very primitive state. Classic 8-bit games (such as Pac-Man), 2D pixel graphics, and synthetic sounds and music are cutting-edge technology.\nIn live-action, standard practice is to render bleeping Arcade Sounds, and bounce a shifting light pattern off the characters playing (read: Button Mashing furiously). In animation, actual game graphics can be rendered, but they are seldom very sophisticated. If the video game's graphics are depicted in-show and are 2D, the sprites will often feature irregularly-shaped\/\"angled\" pixels that actual sprite-based hardware couldn't handle until the mid-SNES era at best. Game music is almost never heard, and if it is, it's almost always an 8-bit chiptune.\nCharacters talking about video games will similarly seem out-of-touch. They will refer to the game in numbered levels and the main goal will be Scoring Points, which are elements tied more to arcades than home consoles. If a story line is mentioned, it will only be as deep as \"save the galaxy from aliens\". It seems that the only way to play these games is to hit all the buttons as fast as possible and to move the control stick(s) wildly without direction, especially when playing with someone else.\nThis trope has many root causes. Most important of all is that high-quality game graphics\/sounds\/music competes for screen time and the viewer's attention — similar to the cause of Stylistic Suck. Plus, the music in particular may ruin the overall tone if they were to actually use the in-game soundtrack. The second reason would be money. While it wouldn't be hard to toss in some footage and sound from a modern game, it may cost quite a bit to get the rights to do so, and it would definitely cost quite a bit to make something original. Thirdly, primitive game graphics can be a visual shorthand for \"not real\" in cartoons, which are already moving, simplified graphics. Last of all, since Most Writers Are Adults, they may not be avid gamers, either knowing only the 8-bit glory of their youth or having come of age before video games. This actually resulted in a strange Coconut Effect for a long time in both film and television depictions of gaming, only in recent years has this trope been starting to be averted.\nIf you're too young to remember what Pac-Man was like on the 2600, check this out. And this for good measure. And, this is Donkey Kong on the same system. These two games probably account for the vast, vast majority of Arcade Sounds used on TV. Very rarely, though, you'll hear a Super Mario Bros. sound effect, or one from Sonic the Hedgehog every once in a blue moon.\nWhile obviously unrealistic for most settings, from a storytelling perspective the audio and graphics will instantly tell any audience member of any age that the characters are playing a video game, as opposed to watching a movie where a more realistic approach is usednote This is helped somewhat by re-releases and indie games keeping this style of game from disappearing altogether. This may be a Discredited Trope before long, being replaced by Ultra Super Death Gore Fest Chainsawer 3000 thanks to Moral Guardians. High profile Product Placement may cause this as well, if the video game industry outperforms other media.\nNote that we're assuming that the characters haven't purchased games online or modified their consoles to play old games, unless otherwise stated.\nSee also: Arcade Sounds, Beeping Computers, Fictional Video Game, Video Arcade, The Coconut Effect, Public Medium Ignorance, Two Decades Behind, and Hollywood Game Design. Compare Stock Footage. If pushed far enough, it can lead to Schizo Tech. Not to be confused with the Nintendo GameCube game of the same name or an obsession about a certain Filipino boxer. For the case of someone playing Pac-Man feverently, see Just One More Level.\nThe Trope Namer is the 1982 novelty song \"Pac-Man Fever\" by Buckner and Garcia.\n",
        "example": " The kids get affected with a grenade that makes them all float and one of the smallest ones says  \"It's zero gravity! Just like in  Halo !\" What?  Critical Research Failure  doesn't begins to describe that.",
        "img_url": "https://mediaproxy.tvtropes.org/width/1200/https://static.tvtropes.org/pmwiki/pub/images/pacman_fever_album_cover.png"
    }
]