[
    {
        "trope_id": "t15712",
        "ratio": 2.375,
        "trope": "NotScreenedForCritics",
        "description": "\nSo it's Friday, and you're considering seeing this new movie that has just Opened In Theaters Everywhere. Before you do, you grab a copy of today's newspaper, and turn to the movie section, looking for a review. Or you check a site like Rotten Tomatoes or Metacritic to get both their combined metascore and the reviews that come with it.\nInstead of a review, you read a notice stating that the film was \"not screened for critics.\" The review compilation sites also have very few reviews and can't compute a review score from it. This is almost always a big warning sign about the quality of the movie. For the vast majority of movies that do this, they suspect that under normal circumstances, the reviewers would have seen the film already on DVD \"screeners\" or private showings, and would have had plenty of time to write witty, biting criticism (or just plain vituperation) that would have completely eviscerated it. The general indication is that the studio doesn't want people to be warned away from the movie prior to opening day.\nAnother tactic by studios is to allow critics to see a preview screening... with a bunch of contest winners, so that instead of being able to make notes and review a film in a quiet theater or purpose-built screening room, the critic has to do it in a crowded megaplex with people who probably wouldn't have seen the movie at all if they hadn't won free tickets and will probably like it only because they didn't have to pay to see it. Films aimed at kids and teenagers might get a rowdy and rambunctious audience throughout the entire film (worse if it features the Teen Idol of the moment). One of the actors or producers may even make a \"surprise\" personal appearance, taking away any sense of a neutral setting (are you going to tell them their film is awful in person?). Many critics thus will easily not take the bait and stay away in droves for their sanity.\nThis tends to happen a lot during the months of January, February, and late August - the traditional Dump Months where all the movies in which the studio no longer has faith but which it is contractually obligated to release get dumped, leaving the good months for Summer Blockbusters and Oscar Bait.\nThis happens with video games as well; most prominent review outlets tend to get copies of games early, and it's telling what the publisher thinks of a game if a website like IGN or Gamespot have to purchase the game themselves on release day. Happens less with big budget games, since they are often cushioned by months of positive preview coveragenote Negative preview coverage is rarer in video games because publishers have more methods of controlling the message than movies do, due to the difference in mediums that have convinced many to preorder the game before reviews are even a factor.\nTelevision is also an area where this occurs - preview DVDs (formerly tapes) are sent to reviewers so they can write their reviews. Where this does not occur, it is for three reasons:\nThe number of preview DVDs being sent out is also slowly decreasing overall, as studios have finally realized where all those pre-theatrical-release DVD rips of blockbusters floating around the internet actually come from. However, this doesn't mean previews stop being sent altogether, just that fewer reviewers are trusted with copies. TV networks also screen their programs over the internet on password-protected sites for critics, although this can also be discouraging (any television critic can tell you that they'd rather do anything else than watch a program on the infamously glitchy ABC MediaNet site).\nOf course, on the other hand, small press, indie and underground works usually don't send out review copies, as they tend to be much less concerned with promotion or mainstream opinion; most big name news sources don't care much to review obscure works anyway.\nCompare It's Not Supposed to Win Oscars.\n",
        "example": " All Eyez On Me wasn't screened for critics prior to it's release, worrying fans of Tupac Shakur that the film wouldn't do the iconic, but controversial rapper justice. Come release, while the cast was praised, and most audiences were receptive to the film, it garnered largely negative reviews, mostly stemming from it's many historical innacuracies about Shakur's life  something his childhood friend Jada Pinkett Smith took personal issue with.\n",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/PennyArcade_critics_cropped_6244.png"
    },
    {
        "trope_id": "t00182",
        "ratio": 2.25,
        "trope": "ActionDressRip",
        "description": "\nAction Girl Alice enjoys getting dressed up for the night, but alas, the one time she puts on the polish, she will find herself in combat. Needless to say, Alice can't fight while wearing a tight-fitting top and a voluminous skirt that hinders the motion of her legs, but there's no time to change and modesty restrains her from just taking the whole thing off. So she grabs a knife off the nearest carving station and tears her beautiful clothes (usually by raising the hem or cutting a slit in the side) so that she can move freely. (Don't ask why she doesn't ditch the high heels too).\nSome Fanservice occurs, as this is a combination of Clothing Damage and She's Got Legs.\nA minor form of Battle Strip.\nCompare Rip Tailoring (a non-action version), Minidress of Power, From Dress to Dressing. Contrast Kicking Ass in All Her Finery, Battle Ballgown.\n",
        "example": " The titular American Ninja does that early in the 1st film. He rescues a young woman from kidnapping and needs her to move through the jungle quickly. He breaks heels off her shoes, then cuts her tight skirt and ties the shreds to create less constricting shorts.\n",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/dressrip_8982.png"
    },
    {
        "trope_id": "t10030",
        "ratio": 2.0,
        "trope": "HellOnEarth",
        "description": "\nA subtrope of The End of the World as We Know It, Hell On Earth is what happens when The Legions of Hell decide to invade our world.\nMaybe some ancient ritual went horribly wrong (or horribly right, or even Just as Planned) and opened a Hellgate, maybe the border between our world and Hell got torn asunder, or maybe our heroes unleashed it themselves by mistake. What the demons want mainly depends on the type of story and the type of demons involved. Whether they want to enslave us, annihilate us, eat us or worse, expect things to get a whole lot worse for anyone who isn't a demon.\nAs an End of the World scenario, most of the time when this shows up in media, it's an Evil Plan that has to be stopped lest all be lost, and usually does get stopped Just in Time. In that case it is a specific supernatural case of the villains having the Dystopia Justifies the Means as their motivation. But in some stories and series, the end has already happened, or happens in story, and now the heroes have to survive and hopefully find a way to either kill the demons or send them back where they came from and make sure that this doesn't happen again.\nSee Hell Invades Heaven for the one thing worse than this. Not to be confused with Mordor, which is usually just metaphorically Hell on Earth.\nFor many of these examples, unmarked spoilers ahead.\n",
        "example": " According to one interpretation by  Word of God , the goal of Grendel's mother is  to sire another demonkind via humans in order to repopulate the lands, as she and her race were their original dwellers. However, this seems a bit hard to accomplish the way it is shown in the story, as it seems she only seeks to mate with the current king, has one child every time, and only does it if the previous one is killed.",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/hellgate_london.png"
    },
    {
        "trope_id": "t27667",
        "ratio": 2.0,
        "trope": "MrMuffykins",
        "description": "\nThere is a particular kind of little yappy dog who tends to get on a lot of people's nerves.\nThe thing is, as theorized by no less than Gary Larson of The Far Side fame, it might not be the dogs that people have a problem with so much. It may actually be the rather specific kind of person who tends to have little yappy dogs named Mr. Muffykins (or something equally ludicrous). In fiction, Idle Rich old ladies or Grande Dames in particular tend to have a small pack of little fluffy creatures. In older fiction, said dogs will have foul little hearts and minds deep within their fluffy little bodies.\nNewer versions of this Trope may have their roots in a very odd phenomenon. Increasingly, it seems as if some people (generally older and either childless or suffering severe empty-nest syndrome) are confusing lap dogs with furry little children. A very different kind of Pinocchio Syndrome seems to be in effect here; think of how lonely and delusional Geppetto had to have been to treat a cat, a goldfish, and an inanimate hunk of wood as his children.\nIn any case, we now live in a world where, if you wanted to do so, you could get your terrier's nails painted as she gets fitted for a thousand-dollar collar. Never mind the fact that dogs are very obviously (you'd think) not little furry humans, and have markedly different wants and needs. Your terrier would be just as happy — and probably more happy — with an inexpensive, comfortable fabric collar and an afternoon playing with you in the park.\nSo an increasingly common subversion has been to show the dog itself as a sympathetic character; a victim of too much misguided attention with a master who is delusional if not outright hateful. While the trope is older than this, one has to wonder how many of these are influenced by Paris Hilton's dog.\nFor the record, most people in reality who have small dogs are more sensible even when they do think of them as \"furbabies\". Tiny \"purse\" dogs are a matter of convenience, especially in an urban environment. A smaller dog needs much less space to be happy, and they also tend to live longer than larger breeds.\nExpect this character to be Cute, but Cacophonic, whether friendly or not. If they can back up their bark with bite, this makes them a Killer Rabbit. If they can't but they try to fight anyway, they are a Boisterous Weakling. Compare The Napoleon and Psycho Poodle, and contrast (naturally) Big Friendly Dog. And please don't Eat the Dog... as there's barely enough meat here for an hors d'oeuvre. The really annoying form of Mister Muffykins can make a Kick the Dog very satisfying indeed.\nContrast Men Like Dogs, Women Like Cats, to which small purse-sized dogs tend to be an exception. If they are actually named \"Mister Muffykins\" or something similar, they're a Formally Named Pet.\n",
        "example": " A Fish Called Wanda: The key witness to the robbery is an old lady with three small Yorkies, who end up getting killed off one by one each time Ken -the animal lover- tries to assassinate the old lady.\n",
        "img_url": "https://mediaproxy.tvtropes.org/width/1200/https://static.tvtropes.org/pmwiki/pub/images/1000014041.jpg"
    },
    {
        "trope_id": "t07899",
        "ratio": 2.0,
        "trope": "FetishRetardant",
        "description": "\nSometimes sexy things happen in a show. Sometimes they're not entirely intended that way, but end up being made out as such.\nSometimes the setup is there but something kills it. Replacing a love scene's music with Entry of the Gladiators circus music will rapidly turn something appealing into something bizarre, absolutely wrecking any gratification the viewer might get out of it.\nThe writer might not realize that their knowledge of the reproductive system is limited at best. Or the exotic elements could just be overwhelmed by good ol' fashioned Nightmare Fuel. It's important to remember, however, that there is no such thing as complete Fetish Retardant, because if it exists, somebody will find it arousing in spite of any efforts to make it unappealing.\nSubtropes include No Yay, IKEA Erotica, and Mills and Boon Prose.\nFetish Retardant applies only when the unsexiness is entirely unintended, perhaps making something like a sexual Narm moment. If the retarding is something added in on purpose to keep the scene from being sexy, that's Fan Disservice (though this can backfire spectacularly).\nInherently Funny Words and Unusual Euphemisms are major causes of Fetish Retardant in written erotica. Written Sound Effects often combine the two.\nContrast Rule of Sexy (although it can become this when it fails). When this is inverted, it's Think Unsexy Thoughts. Naturally, these are Subjective, so there's no need to keep contesting entries; just bring them over to Fetish Fuel.\nAny attempt to introduce actual rules for sexual acts in roleplaying games falls under this, chiefly due to the sheer awkwardness of roleplaying sexual encounters with close friends.\nThis happens to a lot of fanfic (Sturgeon's Law, remember) for various reasons. IKEA Erotica, creepy\/weird euphemisms, Anatomically Impossible Sex, spelling mistakes that add fuel to the Narm fire, or just the Fridge Horror that sets in when you realize you're reading porn about a children's cartoon.\nIn Video Games, most eroge\/visual novel translations suffer from severely mood-breaking onomatopoeias. Fellatio simply should NOT make the sound \"chap chap chap\".\nWhen this happens In-Universe, it's a kind of Moment Killer.\nFetish Retardant is accidental by definition; when it's planned, that's Fan Disservice. If this trope happens right from the get-go, expect an Audience-Alienating Premise. It should be noted that this trope is based entirely on opinion, as what some people regard as a turn-off might end up being a turn-on for others, depending on how they see it.\nBe careful with Hentai and Pornography examples, please, as per wiki rules.\n",
        "example": " Burt Reynolds and Shirley Maclaine making out in the back seat in Cannonball Run II.\n",
        "img_url": "https://mediaproxy.tvtropes.org/width/1200/https://static.tvtropes.org/pmwiki/pub/images/sensational_she_hulk_vol_1_40.png"
    }
]