[
    {
        "trope_id": "t04369",
        "ratio": 8.0,
        "trope": "ContinuityReboot",
        "description": "\nThe writers of a particular work are about to start working on a continuation story, but they have an irreparable issue with the prior continuity.\nMaybe Continuity Snarl has made writing an interesting plot increasingly difficult and tedious. Maybe the last episodes of the series made disliked decisions that changed the status quo and subsequent episodes would suffer from the changes made. Maybe the previous series ended and the writers want to start a new series that uses the same characters or takes the series in a different direction or style but don't want to override the ending of the old series. Maybe Continuity Lock-Out is preventing new fans from being attracted to the series. Or a well liked character was killed off and the writers want to use him or her again without making their death look cheap or if the character is a villain, without suffering Villain Decay.\nThe solution? Initiate a Continuity Reboot.\nA Continuity Reboot is the partial or complete elimination of continuity from any and all previous works in a series. You could say it's the creation of an Alternate Universe that shares virtually little to no canonicity with the preceding works in a franchise. It's not a Reset Button or Snap Back: while those revert the continuity to a previous state, a Continuity Reboot starts over, providing the authors with a new clean slate to work on. In one form, as far as later works are concerned everything before it is in Canon Discontinuity (to which it sometimes overlaps).\nFrequently, a Continuity Reboot will include one (or more) Tone Shifts, usually to whatever is considered the best money-maker for the target demographic, Darker and Edgier or Lighter and Softer.\nWhile they are not a bad thing in and of themselves, nor are they usually intended to outright replace the original work, a Continuity Reboot itself may be poorly received if handled poorly as it effectively negates any and all character development by a character to start anew and in extreme cases the rebooted character is effectively a completely different character under the same name. If the previous series has already ended and the Reboot is a revival of the franchise then it is more likely to be accepted by audience members.\nSister trope to Alternate Continuity, the difference is that a Continuity Reboot becomes the new main continuity rather than running alongside the previous universe. For example, Batman comics run alongside any Batman cartoon or movie that is currently airing and each are their own universe; this is an Alternate Continuity. The DC New 52 comics are a new continuity that replaces previous DC comics; this is a Continuity Reboot.note  Of course, in more complex franchises, the two tropes can overlap. DuckTales 2017 is a reboot of DuckTales, long since cancelled, but is also an Alternate Continuity of the original comics, which are still running.\nA close relative of the regular Retcon and Cosmic Retcon and Retool. Overlaps with Fix Fic if the reboot's intent is to repair perceived problems with the original version.\nOften called a \"re-imagining\" by squeamish writers not wanting to admit that they are throwing out previous continuity (though not always, see Alternate Continuity for exceptions), though this causes confusion as \"re-imagining\" is also used in the same context as \"remake\": ground-up retellings with no connection to past continuity (Planet of the Apes (2001), for example, which is credited with popularizing the term \"re-imagining\" in this context). For when the reboot is is caused by a specific, identifiable character, that character is a Continuity Rebooter. When it just happens to one person it is Ret Gone. If the original continuity is later revisited and ignores the newer canon, you have an Unreboot.\n",
        "example": " A Nightmare on Elm Street was rebooted in 2010, with Jackie Earle Haley taking over the role of Freddy.\n",
        "img_url": "https://mediaproxy.tvtropes.org/width/1200/https://static.tvtropes.org/pmwiki/pub/images/continuity_reboot_1200px.png"
    },
    {
        "trope_id": "t00444",
        "ratio": 6.0,
        "trope": "AHandfulForAnEye",
        "description": "\nThis is a simple yet effective method of improving your odds of victory. A character with no compunctions about cheating flings a handful of something into the eyes of their combatant for a temporary combat advantage.\nIn most situations this will be a handful of loose dirt or sand grabbed from the ground, but in some instances more dangerous and painful materials can be used to attempt a permanent blinding.\nAlso see Smoke Bomb, Go for the Eye, Eye Poke, Step into the Blinding Fight and Blinded by the Light. If you're thinking of eyes on the palms then you're looking for Eyes Do Not Belong There.\n",
        "example": " Spider-Man does this a lot to his foes, webbing them in the face, stopping them temporarily.\n In Spider-Man Spidey does it the Green Goblin just as hes about to shoot him and MJ. Later on he webs J Jonah Jamesons face just to shut him up.\n He does the same to The Lizard in The Amazing Spiderman. Unfortunately, thanks to the reptile claws he just peels it off quickly.\n Most impressively Spider-Man does this  to Thanos in Avengers: Infinity War echoing the original comic. Though it successfully blinds the Titan, Thanos still manages to fight off both Dr Strange and Drax while blinded; and then rip the webbing off his face very pissed at the insect who did it.\n",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/handful.png"
    },
    {
        "trope_id": "t15712",
        "ratio": 5.5,
        "trope": "NotScreenedForCritics",
        "description": "\nSo it's Friday, and you're considering seeing this new movie that has just Opened In Theaters Everywhere. Before you do, you grab a copy of today's newspaper, and turn to the movie section, looking for a review. Or you check a site like Rotten Tomatoes or Metacritic to get both their combined metascore and the reviews that come with it.\nInstead of a review, you read a notice stating that the film was \"not screened for critics.\" The review compilation sites also have very few reviews and can't compute a review score from it. This is almost always a big warning sign about the quality of the movie. For the vast majority of movies that do this, they suspect that under normal circumstances, the reviewers would have seen the film already on DVD \"screeners\" or private showings, and would have had plenty of time to write witty, biting criticism (or just plain vituperation) that would have completely eviscerated it. The general indication is that the studio doesn't want people to be warned away from the movie prior to opening day.\nAnother tactic by studios is to allow critics to see a preview screening... with a bunch of contest winners, so that instead of being able to make notes and review a film in a quiet theater or purpose-built screening room, the critic has to do it in a crowded megaplex with people who probably wouldn't have seen the movie at all if they hadn't won free tickets and will probably like it only because they didn't have to pay to see it. Films aimed at kids and teenagers might get a rowdy and rambunctious audience throughout the entire film (worse if it features the Teen Idol of the moment). One of the actors or producers may even make a \"surprise\" personal appearance, taking away any sense of a neutral setting (are you going to tell them their film is awful in person?). Many critics thus will easily not take the bait and stay away in droves for their sanity.\nThis tends to happen a lot during the months of January, February, and late August - the traditional Dump Months where all the movies in which the studio no longer has faith but which it is contractually obligated to release get dumped, leaving the good months for Summer Blockbusters and Oscar Bait.\nThis happens with video games as well; most prominent review outlets tend to get copies of games early, and it's telling what the publisher thinks of a game if a website like IGN or Gamespot have to purchase the game themselves on release day. Happens less with big budget games, since they are often cushioned by months of positive preview coveragenote Negative preview coverage is rarer in video games because publishers have more methods of controlling the message than movies do, due to the difference in mediums that have convinced many to preorder the game before reviews are even a factor.\nTelevision is also an area where this occurs - preview DVDs (formerly tapes) are sent to reviewers so they can write their reviews. Where this does not occur, it is for three reasons:\nThe number of preview DVDs being sent out is also slowly decreasing overall, as studios have finally realized where all those pre-theatrical-release DVD rips of blockbusters floating around the internet actually come from. However, this doesn't mean previews stop being sent altogether, just that fewer reviewers are trusted with copies. TV networks also screen their programs over the internet on password-protected sites for critics, although this can also be discouraging (any television critic can tell you that they'd rather do anything else than watch a program on the infamously glitchy ABC MediaNet site).\nOf course, on the other hand, small press, indie and underground works usually don't send out review copies, as they tend to be much less concerned with promotion or mainstream opinion; most big name news sources don't care much to review obscure works anyway.\nCompare It's Not Supposed to Win Oscars.\n",
        "example": " All Eyez On Me wasn't screened for critics prior to it's release, worrying fans of Tupac Shakur that the film wouldn't do the iconic, but controversial rapper justice. Come release, while the cast was praised, and most audiences were receptive to the film, it garnered largely negative reviews, mostly stemming from it's many historical innacuracies about Shakur's life  something his childhood friend Jada Pinkett Smith took personal issue with.\n",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/PennyArcade_critics_cropped_6244.png"
    },
    {
        "trope_id": "t07555",
        "ratio": 5.0,
        "trope": "FakinMacGuffin",
        "description": "When someone wants an important Plot Device, one trick is to make a replica of the object, with the intent of tricking the opponent into thinking that the phony is the real McCoy.\nThis can resolve a Hostage for MacGuffin situation: The hero reluctantly hands over the object (which, by the way, might or might not be a MacGuffin), the audience facepalms, the villain gloats... and then it turns out that the object the hero handed over was actually a fake.\nThe effect of the fake object will vary: sometimes it will destroy the villain when he tries to use it, or even bestow the mysterious boon he was trying to steal on the hero instead; sometimes, of course, it will merely do nothing at all.\nHopefully, the existence of the phony will have been set up in advance, and some effort will be expended to explain why the villain doesn't immediately notice it's a phony.\nNot to be confused with Mock Guffin, when it turns out in the end that the MacGuffin everybody has been chasing is a fake, and there is no \"real\" MacGuffin. For when the fake MacGuffin also turns out to be a booby trap, see Somebody Set Up Us the Bomb. This can be used to set up a Needle in a Stack of Needles situation when the real MacGuffin is hidden among a bunch of fakes, or when you need to transport the real item somewhere and the fakes are put in multiple Decoy Convoys.\nUsually, the audience doesn't find out that the villain's got a phony until the villain does (or until the hero reassures his sidekick), so unmarked spoilers abound.\n",
        "example": " In A View to a Kill, James Bond swaps a tape recording Pola Ivanova made of Zorin's plans with a tape of Japanese music.\n",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/mcguffins.jpg"
    },
    {
        "trope_id": "t16923",
        "ratio": 5.0,
        "trope": "PetFadStarter",
        "description": "When the appearance of an animal in a work of media leads to a sudden spike in demand for it as a pet. Basically, an animal version of The Red Stapler. This is quite common with dog breeds that become popular due to a TV show, as many dogs on TV are purebred, and anthropomorphized animal superheroes such as the Teenage Mutant Ninja Turtles.\nThis should go without saying, but buying an animal on impulse is a bad idea, and can lead to undue stress on both pet and owner. When a movie featuring a certain animal comes out, advocacy groups often put out messages to discourage people from suddenly buying it, and for good reason: when the hype dies down, people—especially children—often grow bored of the pet, especially when it turned out to be more work than they expected. This has led to a lot of animals being killed, abandoned, released into the wild regardless of the effect it may have on the local ecosystem, or worst yet, living a short miserable life due to inadequate care. It doesn't help that high demand can lead to breeders churning out the animals as fast as possible and passing off things like inbred dogs or wild-caught reptiles, both prone to various health problems, onto unwitting buyers.\nThis trope is fortunately not as dire as it used to be thanks to the internet. Nowadays, any creature that can be kept as a pet (one way or another) will have a slew of websites and forums dedicated to its captive care, allowing would-be owners to do plenty of research before making a purchase. In the past, people had to trust the word of their local pet store, whose biggest concern was obviously making the sale, and whose clerks might not be the most knowledgeable about specific breeds\/species. While the internet doesn't eliminate this trope completely, it does reduce the number of turtles ending up in sewers for real.\nSub-trope to The Red Stapler.\n",
        "example": " The Air Bud franchise boosted the popularity of Golden Retriever, which was already popular.\n",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/v_masks.png"
    }
]