[
    {
        "trope_id": "t05682",
        "ratio": 1.1666666667,
        "trope": "DieHardOnAnX",
        "description": "Bad guys have taken over some location or vehicle, usually holding several hostages and almost always in an enclosed space, but, unbeknownst to the villains, one or more good guys are hiding out in their midst, engineering their overthrow. At least one air vent passageway will be crawled through. At least one hostage will be a member of The Hero's family and another will be executed while trying to negotiate with the villains.\nNamed after a meme within the entertainment industry based on the movie of the same name, starring Bruce Willis. One of the most important action films of all time, if all the copycat ripoffs are any indication. An old story says that the High Concept pitches for many action films basically went \"Die Hard on\/in a [location of the film]\", until one day, someone tried to pitch a movie as \"Die Hard in an Office Building.\" Apparently, they were unaware that the original Die Hard did take place in an office building.\nThis plot can be used as the action for a Bottle Episode. The bad guys may unknowingly have Bruce Wayne Held Hostage. Expect to see at least one Bulletproof Human Shield show up.\nThis trope can be played with varying degrees of blatancy, so remember, just because a work appears on this list doesn't make it a total knockoff of Die Hard. It's just a basic framework.\nThis trope was hit hard by Technology Marches On: the existence and wide usage of cell phones is a major game-breaking issue for a \"Die Hard\" scenario, as any unprepared hostage has the power to talk to the police from inside a closed location without any previous set-up. Modern versions must acknowledge them and take them all out of play somehow for the plan to even start to work.\nSee also All Your Base Are Belong to Us, \"Home Alone\" Antics, Spanner in the Works, Right Man in the Wrong Place, Stumbled Into the Plot. A Trapped with Monster Plot can be seen as the inversion of this, with the John McClane figure being the villain; a common joke is that a xenomorph audience would see Alien as Die Hard on a space freighter.\nRecycled In Space is the general trope for remaking works in a new setting.\n",
        "example": " Honest Trailers discusses this during their video for the original Die Hard film. They point that it it is the original masterpiece that inspired several knock-offs, like: \"Die Hard\" on a Bus, \"Die Hard\" in a tunnel, \"Die Hard\" on a mountain, \"Die Hard\" in the White House, \"Die Hard\" in the White House 2, \"Die Hard\" in a mall, \"Die Hard\" on a boat, \"Die Hard\" on this other boat, \"Die Hard\" in a rink, \"Die Hard\" on a train, \"Die Hard\" in a plane, \"Die Hard\" in another plane, \"Die Hard\" in the president's plane, \"Die Hard\" in a plane... with snakes! and \"Die Hard\", but awful.\n",
        "img_url": "https://mediaproxy.tvtropes.org/width/1200/https://static.tvtropes.org/pmwiki/pub/images/img_3914_2.jpeg"
    },
    {
        "trope_id": "t02933",
        "ratio": 0.8571428571,
        "trope": "BTeamSequel",
        "description": "When executives have a hit on their hands, the first thing they tend to want is a sequel to cash in on the hype. But sometimes the creators don't cooperate. Maybe it would take a long time to really do a sequel justice and the execs want a quick turnaround. Maybe the creators have become tired of the franchise and want to move on to something new. Sequelitis Or maybe one or more key creators fell victim to Author Existence Failure.\nFortunately (or unfortunately as the case may be), there's a compromise solution: hand it off to the B-team and let the original creators either take their time to make the \"real\" sequel or move on to whatever they'd rather be working on next.\nThis often happens in video game franchises. Since a totally new sequel with new assets and even a new engine can take many years to create, publishers will often task a different studio with making a quick-and-dirty Mission-Pack Sequel while the original studio takes their time to make the \"real\" sequel. Some annualized franchises even alternate years between the A-team and B-team.\nIn film, this often happens when the original director steps back into a producing or consulting role, and is sometimes accompanied by a \"soft reboot\" in which previous installments are still canon in Broad Strokes but there's a major tonal shift. As such, the line between this and a full Reboot can sometimes get fuzzy.\nThis is de rigueur in comic books, where until relatively recently franchises very rarely stayed in their original creator's hands; thus, only especially notable comics examples should be listed.\nNaturally, results vary, and many a Contested Sequel has come about due to this practice. Sometimes the B-team feels too beholden to the original, leading to cries of It's the Same, Now It Sucks!. Of course, if they stray too far, fans may cry that They Changed It, Now It Sucks! because Only the Creator Does It Right. Either way, it's a leading cause of the Sophomore Slump in video games and movies.\nOn the other hand, sometimes a fresh set of hands can lead to a Surprisingly Improved Sequel or Even Better Sequel; if and when the original creators do return to a franchise, they might be surprised to find that fans now consider the \"B-team\" to be My Real Daddy. In extreme cases, the cycle can continue with the B-team becoming the new A-team when the franchise is handed off to a third creator years or even decades down the road.\nAnother major cause of a sequel falling into different hands is when a group runs afoul of Creative Differences. If one vision contrasts with another, it may become a tug-of-war for creative control until someone wins out. In other situations, problems may arise that force one group to bail out, or sell off the rights to produce if they go bankrupt. Contracts can affect where these rights go and when, and if companies divide, it's possible the work will be handled by a replacement group, some of which may have divergent ideas from the original. There is also Sequelitis, the trend where works fall out of favor when new installments don't do the previous ones justice, and a lot of the time, it's because someone gets too fast and loose with the elements of a work and creates a big mess as they run out of ways to keep the magic going. The simplest fix is to hand it off to new blood with decent ideas to employ.\nIf a new creator only finishes a work that's already been extensively worked on by a tragically deceased predecessor rather than come up with an entirely new sequel, see Posthumous Collaboration.\nCompare Changing of the Guard, which is when a sequel focuses on different characters, and with which this sometimes overlaps.\n",
        "example": " Jerry Zucker, David Zucker, and Jim Abrahams initially agreed to make Airplane II: The Sequel, and then balked at the idea at a later date. The movie went ahead without their permission, and despite their protests - thus, they refused to watch a single frame of it upon its release - and still have not over twenty years later.\n",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/temp_18.png"
    },
    {
        "trope_id": "t13313",
        "ratio": 0.8333333333,
        "trope": "LoveTriangle",
        "description": "\nAlice is in love with Bob, but Bob is in love with Charlie, while Charlie is in love with Alice. Well, that's one of them. A Love Triangle commonly involves three people, love, and decisions. It can be dramatic, or it can result in Wacky Hijinx. Sometimes a fourth person is brought in to make it right, sometimes somebody might be kicked out. See Triang Relations for all the ways these three people can mess up their love lives.\nVery common in Soap Opera.\nSometimes a Love Triangle can come to involve a fourth person, while still ultimately being called a \"triangle.\" But move complications that insist on widening it can be explored further in a Love Dodecahedron.\nCompare Friend Versus Lover.\n\"But I love him!\"\n\"I am so conflicted!\"\n",
        "example": " Wilbur is chuffed to think that he is in one with Sandra and Joan. However, he has failed to consider  The Schlub Pub Seduction Deduction .",
        "img_url": "https://mediaproxy.tvtropes.org/width/1200/https://static.tvtropes.org/pmwiki/pub/images/this_means_a_love_triangle.png"
    },
    {
        "trope_id": "t02549",
        "ratio": 0.5555555556,
        "trope": "BMovie",
        "description": "\nThe Great Depression hit Hollywood almost as hard as it hit other industries; a third of the audience disappeared between 1929 and 1933. To combat this, the major studios distributed feature films in pairs meant to be screened as a Double Feature. The longer and bigger-budgeted of the two films was called an \"A-movie\", while the secondary feature was called a \"B-movie.\"note There was also a species known as a \"programmer\", which could be used as either.At first, the studios maintained separate production units to make the Bs; these units served as training grounds for talent on the way up and as last stops for talent on the way down. Later, the studios just bought pictures from \"Poverty Row\" studios like Monogram, Mascot  Republic; again, some stars were able to use these pictures to make or remake their careers, notably John Wayne and Roy Rogers.\nThe tag B-Movie or \"b-movie spirit\" which is used in contemporary times is more or less an artifact. It's been a while since there have been actual B-movies, i.e. a movie released as a bottom-half of a double-bill, the freebie to get out of the way before the \"real\" A-picture starts. The nearest modern correlative would be movies released Direct-to-Video without a theatrical release, or movies made for TV, for cable et al. Considering the higher production values of TV in The Oughties and The New '10s, even this is becoming a misnomer, especially since so many A-directors are migrating to TV. You are far more likely to find the authentic B-Movie experience in arthouse movies or repertory screenings where you have movies paired for double-bill for comparison rather than because one of them is a cheap filler made for a more serious film.\nSome of the ground rules for B-movies date back to these early origins: they were and are produced on a limited budget with cast who are not exactly household names. While B-movies may occasionally have very well-written scripts and gripping plots, the primary goal is not deliberate art or widespread commercial success, but cheap, disposable entertainment. As such, B-movies tend to be genre pieces, in such categories as western (by far the most popular B-genre in Hollywood's Golden Age), horror, Science Fiction, or crime. B-movies are often heavily trope-laden, and a particularly successful one can become a trope maker for big-budget films in the future. During the 30's and 40's, also, B-series were often highly successful; for example, Andy Hardy, Charlie Chan, The Cisco Kid, The Saint, and even Sherlock Holmes (in the sequels produced by Universal).\nAs the studio system collapsed, beginning in the late 1940s and continuing through the 1950s, the double feature faded from profitability and, thus, the need for major studio-distributed Bs declined. On the other hand, the overall decline of the majors left room for independents with a B mentality — American International Pictures and Roger Corman being by far the most prominent — to flourish. In the 1960s and 1970s, the term B-movie came to be synonymous with what was now called \"exploitation films\" — low-budget cash-ins with an emphasis on sensationalism, sexuality, and gore — and the phrase is understood in those terms to this day. During the \"Golden Age\" of the B-movie in the 1950s, 1960s and 1970s, the films were widely distributed and screened in older cinemas colloquially called \"grindhouses,\" supposedly because the movies would be shown over and over again, grinding down the film. Since the dawning of cable TV and home video in The '80s, few B-movies see theatrical release, but are typically produced as TV movies or Direct-to-Video releases, or released directly over the internet. Syfy (formerly the Sci Fi Channel) in particular produces many original B-movies, and Mystery Science Theater 3000 maintained interest in the genre throughout the '90s, with its rereleases of classic B-movies with three characters making snarky comments on the action. While many B-movies are \"bad\" in terms of writing and execution, some prove to be So Bad, It's Good. Those that attempt seriousness are usually full of narm.\nHaving said all that, in the same period as that outlined above and much later, B-Movies came to be seen with respect and admiration by several film-critics, first in France, and then Britain and the United States. Several B-Movies of the 1940s and 1950s, came to be Vindicated by History and were embraced for their subversion of the restrictions of The Hays Code. The code often focused more heavily on the A-Picture and this meant the B-Movie fell Beneath Suspicion. This meant that directors, paradoxically, had more freedom on a B-Movie than an A-Picture. Several films, especially Film Noir, which today are regarded as classics were B-Movies in their day. For example, Detour, by Edgar G. Ulmer, would later be cited by the likes of Martin Scorsese, François Truffaut and as a major masterpiece of cinema. The likes of William Castle were admired by his more high profile peers like Orson Welles and Alfred Hitchcock. Hitchcock in fact took inspiration from the popularity of Castle's low-budget productions to bring Psycho Out of the Ghetto. Roger Corman likewise became celebrated for providing many aspiring film-makers entry into making Hollywood films, everyone from Francis Ford Coppola to James Cameron. As a film-maker, Corman also made stylish film adaptations of Edgar Allan Poe's horror films as well as anti-racist films like The Intruder. Indeed, Corman often insisted, as did many other B-Film-makers that they made \"A-Movies on B-Budgets\".\nCritics noted that the low-budget and limited resources often provided an avenue for film-makers to compensate by technical innovation and heavy use of style, and this meant that the old fashioned B-Movie is a truer ancestor of the modern independent film, in form, even if the latter's content, is closer to the A-Movie of old. The reverse is also true however. The modern blockbuster cinema is A-Movie in terms of its cast and large budgets, the chastity of its storyline and aesthetic, but it is B-Movie in terms of its content (Science-Fiction, Action Movie, Superhero films) which were considered low even by the standards of the B-Movies (many of them being serials and usually not played as part of a Double Bill). Starting with Star Wars, many blockbusters were, initially, derisively named \"a B-movie with A-Budget\" and many of these blockbusters carry the same stigma of the original B-Movie but in an inverted fashion. These films actually make more money and are seen by more people in America and the world (whereas the original B-Movie rarely enjoyed wide-distribution compared to its A-counterpart), but rarely win any awards, compared to the under-seen Oscar Bait. Movies that can be considered B-movies tend not to get too widely noticed these days, many of them going direct to video on VHS and later DVD-BR. They existed for a bit longer in other markets, in Hong Kong, and parts of India, but gentrification spread there eventually. Today, the style of B-Movie has come to be appreciated by some for its camp value, there have been a number of successful big-budget movies that emulate B-movie tropes and production values in a sort of Affectionate Parody. In addition, there have been film-makers who seek to revive and update the old B-Movie aesthetic for what they value as its low-budget inventiveness and sincerity. The style saw a resurgence in the late 2000s as the rise of streaming video and ready access to video recording and editing made low-budget filmmaking and distribution easier than ever.\nContrast Epic Movie. See Unabashed B-Movie Fan for when a character is a fan of one of these, and The Mockbuster for a particular form of Z-movie common today. Not to be confused with Bee Movie.\n\n",
        "example": " A Night to Dismember (1983): Dismembered bodies start piling up after a mentally ill murderess is released from the asylum.\n",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/sharkalancheimagefromseptimusheap_8183.jpg"
    },
    {
        "trope_id": "t11022",
        "ratio": 0.5555555556,
        "trope": "IHaveYourWife",
        "description": "\nThe Big Bad tries to get the hero (or someone else) to do his bidding by taking someone precious from him and essentially holding them to ransom. It's often a significant other, frequently a wife or girlfriend; but any family or friend works, or even strangers if it's a certain type of hero.\nThis sort of thing tends to go in the following sequence:\nHostage for MacGuffin is a subtrope for when the trope occurs with a MacGuffin. If the villain is attracted to the hero, he\/she may give them the Scarpia Ultimatum.\nA common variant used with lone heroes (in which case 6 on the list is not exactly an option) has the hero reluctantly doing what the villain orders him to do, only to be screwed over when the villain reneges on his promise to let the loved one go, usually before killing the loved one in question in a nasty Kick the Dog moment. The result, for many action heroes, is often a Roaring Rampage of Revenge that usually culminates in Storming the Castle and handing the villain the mother of all asskickings for daring to mess with the loved one in the first place. Alternatively, a Roaring Rampage of Rescue ending in the rescue of the loved one may also take place.\nSometimes, a villain will do this as a plot to get a hero to betray his friends, only to have him Rewarded as a Traitor Deserves. It's also a great way to turn a member of the good guys into Regretful Traitor.\nCan't blame many a hero for taking precautions against this.\nSometimes, of course, the intended target may feel that You Can Keep Her, in which case the whole thing is moot by Threat Backfire.\nIf this is the reason why the villain is doing it, then it's a case of The Commies Made Me Do It.\nIn the real world, a kidnapping committed for the purpose of coercing another person to commit a crime on the original criminal's behalf is called a tiger kidnapping. Most real-life kidnappings, tiger or not, tend to end peacefully, whether or not the victim sees the kidnapper's face. This is largely due to pragmatism, as murder is a far more serious offense than kidnapping. Media usually ignores this because of the Rule of Drama, acting like the victim will be killed the second the ransom is paid.\n",
        "example": " Katy is abducted on Lord Belasco's orders, so he can both make Arthur get rid of Calvin and force Sarah to agree to marry him. Of course, when Arthur and Calvin show up with the unharmed Katy, this doesn't work.",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/i_have_your_wife.png"
    }
]