[
    {
        "trope_id": "t02933",
        "ratio": 0.6,
        "trope": "BTeamSequel",
        "description": "When executives have a hit on their hands, the first thing they tend to want is a sequel to cash in on the hype. But sometimes the creators don't cooperate. Maybe it would take a long time to really do a sequel justice and the execs want a quick turnaround. Maybe the creators have become tired of the franchise and want to move on to something new. Sequelitis Or maybe one or more key creators fell victim to Author Existence Failure.\nFortunately (or unfortunately as the case may be), there's a compromise solution: hand it off to the B-team and let the original creators either take their time to make the \"real\" sequel or move on to whatever they'd rather be working on next.\nThis often happens in video game franchises. Since a totally new sequel with new assets and even a new engine can take many years to create, publishers will often task a different studio with making a quick-and-dirty Mission-Pack Sequel while the original studio takes their time to make the \"real\" sequel. Some annualized franchises even alternate years between the A-team and B-team.\nIn film, this often happens when the original director steps back into a producing or consulting role, and is sometimes accompanied by a \"soft reboot\" in which previous installments are still canon in Broad Strokes but there's a major tonal shift. As such, the line between this and a full Reboot can sometimes get fuzzy.\nThis is de rigueur in comic books, where until relatively recently franchises very rarely stayed in their original creator's hands; thus, only especially notable comics examples should be listed.\nNaturally, results vary, and many a Contested Sequel has come about due to this practice. Sometimes the B-team feels too beholden to the original, leading to cries of It's the Same, Now It Sucks!. Of course, if they stray too far, fans may cry that They Changed It, Now It Sucks! because Only the Creator Does It Right. Either way, it's a leading cause of the Sophomore Slump in video games and movies.\nOn the other hand, sometimes a fresh set of hands can lead to a Surprisingly Improved Sequel or Even Better Sequel; if and when the original creators do return to a franchise, they might be surprised to find that fans now consider the \"B-team\" to be My Real Daddy. In extreme cases, the cycle can continue with the B-team becoming the new A-team when the franchise is handed off to a third creator years or even decades down the road.\nAnother major cause of a sequel falling into different hands is when a group runs afoul of Creative Differences. If one vision contrasts with another, it may become a tug-of-war for creative control until someone wins out. In other situations, problems may arise that force one group to bail out, or sell off the rights to produce if they go bankrupt. Contracts can affect where these rights go and when, and if companies divide, it's possible the work will be handled by a replacement group, some of which may have divergent ideas from the original. There is also Sequelitis, the trend where works fall out of favor when new installments don't do the previous ones justice, and a lot of the time, it's because someone gets too fast and loose with the elements of a work and creates a big mess as they run out of ways to keep the magic going. The simplest fix is to hand it off to new blood with decent ideas to employ.\nIf a new creator only finishes a work that's already been extensively worked on by a tragically deceased predecessor rather than come up with an entirely new sequel, see Posthumous Collaboration.\nCompare Changing of the Guard, which is when a sequel focuses on different characters, and with which this sometimes overlaps.\n",
        "example": " Jerry Zucker, David Zucker, and Jim Abrahams initially agreed to make Airplane II: The Sequel, and then balked at the idea at a later date. The movie went ahead without their permission, and despite their protests - thus, they refused to watch a single frame of it upon its release - and still have not over twenty years later.\n",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/temp_18.png"
    },
    {
        "trope_id": "t05828",
        "ratio": 0.4615384615,
        "trope": "DisneyVillainDeath",
        "description": "It appears that villains in the Disney Animated Canon have an especially curious tendency to exit the film by falling off or out of things. Unfortunately for them, even though they are animated characters, they cannot defy gravity.\nThe varied list of things to fall from includes cliffs, over waterfalls, out of trees, and off the tops of buildings. There is at least one case of a Disney villain meeting his end by falling up (off a spaceship and into space), and once sideways (off the Chinese Imperial Palace by the aid of a rocket). A surprising number of Disney villains have also been dragged to their doom by demons (up to three depending on how you're counting).\nSealing the villain's fate with a fall into nowhere serves two main purposes:\nNote that none of these cases have to involve a Climbing Climax, though it may involve a One-Winged Angel transformation beforehand (which is by far the second-favorite trope of Disney villains).\nSometimes, a fatal wound will be inflicted upon the villain just before taking the plunge (whether caused by the hero or by the villain's own actions) just to ensure that he or she is definitely dead. Or, they could have a boulder or similar heavy object falling down with them, which will surely crush them when they land, or fall into a deadly environment like lava or molten metal, a pit of savage beasts, fire, Hell itself, or even flesh-eating green acid, as water alone won't always do it.\nKeep in mind that you don't have to be a Disney villain to meet your end this way — many villains and other characters in action movies, cartoons, books, and other works have also met with this fate, although it's fair to say that most heroes have ways to survive taking the long fall.\nExtremely apparent in Disney's \"Bronze Age\" (the string of late-80s-90s hits). Not to be confused with Disney Death. It seems only good guys get to have those (there is a villainous variant, but Disney doesn't use it often).\nThere is also the non-villainous, non-conflict related variation of the trope, where a character decides to jump off a high ledge due to some stupid idea they have (e.g., thinking they'd fly).\nMay involve a Noose Catch. See also High-Altitude Interrogation and Unhand Them, Villain!, as well as Death by Falling Over. When Recycled In Space, it's Thrown Out the Airlock.\nAs a Death Trope, all Spoilers will be unmarked ahead. Beware.\n\n",
        "example": "  Averted.  Hopper doesn't fall to his demise (and he probably could fly anyway), but is instead  fed to the bird's chicks by their parent , though this is (thankfully) not shown on-screen.",
        "img_url": "https://mediaproxy.tvtropes.org/width/1200/https://static.tvtropes.org/pmwiki/pub/images/nobodyfallslikegaston.png"
    },
    {
        "trope_id": "t02488",
        "ratio": 0.3846153846,
        "trope": "BlondeBrunetteRedhead",
        "description": "\nThe hair equivalent to vanilla, chocolate and strawberry (dessert flavors) or Yellow, Blue, and Red (primary colors). The trope is strictly for visual appeal; they are not personality types.\nSometimes, they're heroes. Sometimes, they're friends. Sometimes, they're contenders, vying for the same love interest. Whatever the details, they're proof that Central Casting does count: three women, three natual hair colors. Collect the full set. This trope was inspired — or at least made famous — by The Andrews Sisters, a Girl Group from the 1940s who were famous for entertaining American army forces during World War II. Their diversity of hair colors was probably due to their partial Norwegian-Greek ancestry, an interesting mixed race in those days.\nStrictly speaking, these women need not have the exact Clairol hues of blonde, brown\/black, and red, particularly when stepping away from the natural spectrum. The blonde will have the lightest hair, the brunette the darkest and the redhead will have a distinct moderate shade — all for instant sight recognition.\nSometimes, a Token Minority may either replacing a Caucasian brunette or stand beside her. The latter case can match the Four-Girl Ensemble: the Sassy Black Woman, the Blonde (beautiful or dumb), the Brainy Brunette, and the Fiery Redhead. Contrast Plenty of Blondes.\nSee also Chromatic Arrangement, Power Trio, The Three Faces of Eve, The Hecate Sisters and Beauty, Brains and Brawn.\n",
        "example": " Fiona and her daughters; Shelby and her two lackeys",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/blonde-brunette-redhead_witches-of-eastwick3_5262.jpg"
    },
    {
        "trope_id": "t10001",
        "ratio": 0.2777777778,
        "trope": "HeKnowsTooMuch",
        "description": "\nSomebody is involved in something dirty, or just did something nasty. Could be The Government, could be The Mafia or The Syndicate, could be General Ripper, a Corrupt Corporate Executive, or an Ancient Conspiracy. No matter what bad guy was involved, somebody saw it all, heard it all, or somehow caught wind of what's going down (or what went down), and the bad guy in question has found out about the witness.\nSince the witness now knows too much, the bad guy's entire scheme may come crashing down, so they aim to \"silence\" the witness in some manner, through bribery, blackmail, intimidation, or even murder.\nA common variant is that the person who purportedly knows too much doesn't actually know anything at all (or at least, doesn't understand what knowledge they have) — but the overly paranoid conspirators believe that they do, thus leading to their campaign of persecution. There's a good chance the hero will eventually get sick of being relentlessly hounded\/threatened\/shot at by the conspirators and start fighting back. In the process, they usually learn the \"real\" secret anyway by constantly coming into contact with said conspirators at every turn and eventually will find a way to bring the plan to ruin. The ironic conclusion, of course, is that if the Big Bad had just relaxed and left the person alone, they'd have succeeded.\nIf it isn't the hero getting persecuted, it will likely be someone the hero cares about, which will usually prompt either a bodyguard scenario as the hero tries to protect them against the bad guys, or a Roaring Rampage of Revenge if the loved one is killed. Either way, it's an excellent MacGuffin.\nThe most common motive for bad guys to go after innocent people, and also part of the reason that the FBI has the Witness Protection Program (in addition to protecting people from revenge after they testify).\nAnother, less sympathetic variation occurs when a character learns a guilty secret possessed by another character and decides it would be a profitable enterprise to blackmail the second character in exchange for their silence. This one usually overlaps with Asshole Victim, since the second character understandably won't like the idea of being on the hook to a sleazy blackmailer for the rest of their life, and is likely to decide that getting rid of the blackmailer will cost them less in the long run than paying up. If the blackmail victim's guilty secret is that they are a murderer, this may also add elements of Too Dumb to Live to the blackmailer — after all, someone who's already killed at least one person is unlikely to have many qualms about bumping off someone else, particularly if that someone else is trying to exploit them for money.\nSee Revealing Cover-Up, Killed to Uphold the Masquerade, Have You Told Anyone Else?, and His Name Is.... See also Leave No Witnesses for those situations where a roomful of people all Learn Too Much at once. Where the knowledge itself is harmful, see These Are Things Man Was Not Meant to Know. Compare also with You Have Outlived Your Usefulness.\n",
        "example": " The reason Ken is tasked to kill the old lady  she's the witness who can identify George.",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/he_knows_too_much_9.png"
    },
    {
        "trope_id": "t13833",
        "ratio": 0.2727272727,
        "trope": "MayDecemberRomance",
        "description": "\nIt refers to a romantic relationship where there is a drastic difference in age between the two participants.\nThese seem to be less common in modern media, perhaps because some now perceive them to be Squicky. However, they still crop up from time to time; they're very common in soaps in particular.\nThe ways in which these relationships can occur in media can vary:\nGenerally, the man is the \"December\" (elder) and the woman is the \"May\" (younger), though it can happen the other way around. This can sometimes be a Double Standard in Hollywood, as while older actors get paired up with younger actresses, it doesn't happen so often in reverse.\nMay lead to cases of Ugly Guy, Hot Wife if the years haven't been kind to him. This is the romantic version of the Intergenerational Friendship.\nIt is the Real Life, mundane version of the Mayfly–December Romance and the Sub-Trope and extreme version of Age-Gap Romance.\nDue to continued confusion over the applicability of this trope, here are the criteria that need to be satisfied to qualify for inclusion here:\nNOTE: This is an OBJECTIVE trope, meaning that it uses explicitly defined criteria; it is NOT a place to put any relationship which feels Squicky due to age differences. 30-year-olds dating 13-year-olds are not this trope.\nThis is Truth in Television, of course, but wasn't nearly as common in the past as some would have us think. Most couples in pre-modern days couldn't afford to marry until both the man and the woman had saved up enough to set up a household, and that could take years; it's therefore perhaps not surprising that the average ages at marriage for both men and women in Elizabethan England are identical to those in 21st century America where most of all married couples are within two to three years of each other. (It was even worse in medieval times when daughters would have to work for years to save up the customary fee owed their father's lord upon their marriage.)\nMost May-December marriages in pre-19th century times were among the aristocracy, whose prominence in the history books is balanced by their small numbers (fewer than 0.5% of the population of Tudor England). Victorian-era historians, however, twisted the narrative, going as far as to destroy and deface records, to justify child marriage. At best their scholarship was unconsciously biased by their desire to justify their own cultural norms; at worst they deliberately lied.\nSee also Christmas Cake, Likes Older Men, and Likes Older Women. Wife Husbandry is when someone intentionally raises a younger person to be their spouse. When the December is a woman, she may be Mrs. Robinson. Compare December–December Romance for romantic pairings between older characters and Merlin and Nimue for non-romantic partnerships with a large age gap and a gender difference. Often the result of an Unequal Pairing. Compare Age-Gap Algebra when a mathematical formula is proposed for determining when a romance is this (and for which the criteria listed above are one example).\n\n",
        "example": " Leopold and Ariel have a very notorious age difference (at the time the film was released, José Ferrer was 70 and Mia Farrow was 37).",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/23ea9529b0a63f0f8e799e36ff9c555a.png"
    }
]