[
    {
        "trope_id": "t16923",
        "ratio": 5.0,
        "trope": "PetFadStarter",
        "description": "When the appearance of an animal in a work of media leads to a sudden spike in demand for it as a pet. Basically, an animal version of The Red Stapler. This is quite common with dog breeds that become popular due to a TV show, as many dogs on TV are purebred, and anthropomorphized animal superheroes such as the Teenage Mutant Ninja Turtles.\nThis should go without saying, but buying an animal on impulse is a bad idea, and can lead to undue stress on both pet and owner. When a movie featuring a certain animal comes out, advocacy groups often put out messages to discourage people from suddenly buying it, and for good reason: when the hype dies down, people—especially children—often grow bored of the pet, especially when it turned out to be more work than they expected. This has led to a lot of animals being killed, abandoned, released into the wild regardless of the effect it may have on the local ecosystem, or worst yet, living a short miserable life due to inadequate care. It doesn't help that high demand can lead to breeders churning out the animals as fast as possible and passing off things like inbred dogs or wild-caught reptiles, both prone to various health problems, onto unwitting buyers.\nThis trope is fortunately not as dire as it used to be thanks to the internet. Nowadays, any creature that can be kept as a pet (one way or another) will have a slew of websites and forums dedicated to its captive care, allowing would-be owners to do plenty of research before making a purchase. In the past, people had to trust the word of their local pet store, whose biggest concern was obviously making the sale, and whose clerks might not be the most knowledgeable about specific breeds\/species. While the internet doesn't eliminate this trope completely, it does reduce the number of turtles ending up in sewers for real.\nSub-trope to The Red Stapler.\n",
        "example": " The Air Bud franchise boosted the popularity of Golden Retriever, which was already popular.\n",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/v_masks.png"
    },
    {
        "trope_id": "t25699",
        "ratio": 3.0,
        "trope": "Wedgie",
        "description": "A classic prank, in which some poor sap gets their underpants forcibly yanked up and wedged between their butt. A staple of schoolyard bullies it is also sometimes incorporated into the arsenal of tricksters and similar comedic fighters.\nVariations include:\nSubtrope of Groin Attack and Amusing Injuries. Watch out for the Negative Space Wedgie.\n",
        "example": " At the end of Aliens in the Attic, the kids use the aliens' mind control device to make Ricky give himself a wedgie in front of his friends.\n",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/9780439050005_2.jpg"
    },
    {
        "trope_id": "t14424",
        "ratio": 2.6666666667,
        "trope": "MoneyDearBoy",
        "description": "\nSometimes, undeniably famous, classical actors and actresses (or even loveable, talented, squeaky-clean child and\/or teen actors\/actresses) take roles in movies that are very against their type. Unlike the Classically Trained Extras, who lament that their talent is being wasted, or the small but legitimate roles of the One-Scene Wonder, or the Old Shame of roles taken when it was the only work available, this trope covers actors who are completely fine with the situation. Why? Money, dear boy.\nObviously, movies are big business, and the right name at the top of the poster can be the difference between a hit and a flop. And it's hard to argue with the fact that, when offered buckets and buckets of cash for three weeks of shooting, anyone would be a fool not to take it. After all, acting is a volatile profession, as many starving artists can attest, and financial security for you and your family is nothing to turn from: It's not so much selling out, as selling well. And furthermore, most creative professions are overcrowded; for every wealthy and successful artist who can afford to sniff at jobs that are 'beneath' him or her, there are ten or more underworked ones who would kill for a chance at the income. On a cynical note, in the state that America is in today, you shouldn't be surprised to see this more often. Most actors have been seen sliding down the perceived hierarchy of the entertainment field, with the most common \"step down\" is for actors who primarily work in film suddenly \"slumming it\" by taking roles on television.\nStill, if you do too many of these, you run the risk of having a rather strange IMDb record and irrevocably ruining your reputation as a creative thespian: so much potential and talent wasted. Some artists, however, can turn this to their advantage; a common reason cited by many successful artists who engage in this trope is that a high-paying job that doesn't greatly interest them means that they have more money to put into funding and appearing in lower-budget but more creatively appealing ones.\nTo be clear, however, there is no shame at all for doing a movie for the money, and if the movie happens to be a great one, artistically or popularly, all the better. Even if it is for the money, the level can be kept high and professional and they can turn out something great (like the example with Coppola and The Godfather).\nIf it ends up a mediocre, run of the mill production, that's also excusable. People in creative jobs need an income the same as anyone else, and in fact, many of the greatest popcorn flicks of all time are great primarily because the studio shelled out the money to get actors and directors who would rather be doing something else, but who were still prepared to give the audience a good performance.\nHowever, should a cash-in movie end up So Bad, It's Horrible, both the audience and the critics are likely to be notably less forgiving than they would be while judging a bad movie with original, artistic premise marred by flawed execution. As a result, rather paradoxically, an artist who takes the job for the money is perhaps best trying to put in a decent (or at least entertaining) performance even in a movie that doesn't match up to their standards. Whether they Took the Bad Film Seriously or end up Chewing the Scenery with Ham and Cheese, they're likely to elicit more respect from the audience than if they took the money but made it clear through their performance that they couldn't care less for anything but the paycheck.\nThis is also the reason for the percentage of high quality foreign artists appearing in crummy American films: Hollywood, even at its most cheapskate, tends to pay much better than any other film industry in the world. Note that this also applies to star in big US television shows; with multi-million dollar deals commonplace, it can allow you to be a lot more choosy for the next few years.\nSimilar to getting a healthy paycheck, some actors will just want to do something \"their kids can watch\", the kind of roles most actors seek usually being dark and not appropriate for minors.\nA common theme — especially among older actors and actresses — stems from growing up during hard economic conditions, either from a poor economy as a whole or from family hardships. The fear that \"The Next Job\" may not come, as it often failed to do for their family, drives them to take roles they might not otherwise be interested in. And, again, they're not exaggerating: any actor, young and old, always deals with extremely uneven income flow with absolutely no hard guarantees for the future. As a general rule, if a recognizable name turns up in a movie featured on MST3K or RiffTrax, this trope is almost certainly why.\nCompare and contrast Doing It for the Art (when artistic value and\/or achievement is the primary motivator), and Awesome, Dear Boy (when the actor takes the role for the coolness of it, regardless of how crappy the work is), Vacation, Dear Boy (where they work on the project so they can go to a special location), and One for the Money; One for the Art (where a creator uses the money earned from a purely commercial project to finance one that's more personal and artistic).\nSee also Contractual Obligation Project, Paying Their Dues, I Was Young and Needed the Money (when this trope is given as the excuse for Old Shame), WTH, Casting Agency?, Took the Bad Film Seriously. Not to be confused with Only in It for the Money, which is when this is the excuse a character uses in-story.\nAlso notice that if a great actor is in a crappy movie, it doesn't necessarily mean that he's in it just for the money; contrast Awesome, Dear Boy and So My Kids Can Watch.\n",
        "example": " Practically any film that the Marx Brothers accepted to make together after A Day at the Races was made to raise money to cover for Chico Marx's recurring debts and expenses. This is especially true of their final film, Love Happy, which was not originally planned to include Groucho and Chico.\n",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/laurence_olivier_2853.jpg"
    },
    {
        "trope_id": "t04369",
        "ratio": 2.5,
        "trope": "ContinuityReboot",
        "description": "\nThe writers of a particular work are about to start working on a continuation story, but they have an irreparable issue with the prior continuity.\nMaybe Continuity Snarl has made writing an interesting plot increasingly difficult and tedious. Maybe the last episodes of the series made disliked decisions that changed the status quo and subsequent episodes would suffer from the changes made. Maybe the previous series ended and the writers want to start a new series that uses the same characters or takes the series in a different direction or style but don't want to override the ending of the old series. Maybe Continuity Lock-Out is preventing new fans from being attracted to the series. Or a well liked character was killed off and the writers want to use him or her again without making their death look cheap or if the character is a villain, without suffering Villain Decay.\nThe solution? Initiate a Continuity Reboot.\nA Continuity Reboot is the partial or complete elimination of continuity from any and all previous works in a series. You could say it's the creation of an Alternate Universe that shares virtually little to no canonicity with the preceding works in a franchise. It's not a Reset Button or Snap Back: while those revert the continuity to a previous state, a Continuity Reboot starts over, providing the authors with a new clean slate to work on. In one form, as far as later works are concerned everything before it is in Canon Discontinuity (to which it sometimes overlaps).\nFrequently, a Continuity Reboot will include one (or more) Tone Shifts, usually to whatever is considered the best money-maker for the target demographic, Darker and Edgier or Lighter and Softer.\nWhile they are not a bad thing in and of themselves, nor are they usually intended to outright replace the original work, a Continuity Reboot itself may be poorly received if handled poorly as it effectively negates any and all character development by a character to start anew and in extreme cases the rebooted character is effectively a completely different character under the same name. If the previous series has already ended and the Reboot is a revival of the franchise then it is more likely to be accepted by audience members.\nSister trope to Alternate Continuity, the difference is that a Continuity Reboot becomes the new main continuity rather than running alongside the previous universe. For example, Batman comics run alongside any Batman cartoon or movie that is currently airing and each are their own universe; this is an Alternate Continuity. The DC New 52 comics are a new continuity that replaces previous DC comics; this is a Continuity Reboot.note  Of course, in more complex franchises, the two tropes can overlap. DuckTales 2017 is a reboot of DuckTales, long since cancelled, but is also an Alternate Continuity of the original comics, which are still running.\nA close relative of the regular Retcon and Cosmic Retcon and Retool. Overlaps with Fix Fic if the reboot's intent is to repair perceived problems with the original version.\nOften called a \"re-imagining\" by squeamish writers not wanting to admit that they are throwing out previous continuity (though not always, see Alternate Continuity for exceptions), though this causes confusion as \"re-imagining\" is also used in the same context as \"remake\": ground-up retellings with no connection to past continuity (Planet of the Apes (2001), for example, which is credited with popularizing the term \"re-imagining\" in this context). For when the reboot is is caused by a specific, identifiable character, that character is a Continuity Rebooter. When it just happens to one person it is Ret Gone. If the original continuity is later revisited and ignores the newer canon, you have an Unreboot.\n",
        "example": " A Nightmare on Elm Street was rebooted in 2010, with Jackie Earle Haley taking over the role of Freddy.\n",
        "img_url": "https://mediaproxy.tvtropes.org/width/1200/https://static.tvtropes.org/pmwiki/pub/images/continuity_reboot_1200px.png"
    },
    {
        "trope_id": "t28363",
        "ratio": 2.5,
        "trope": "LogoGag",
        "description": "\nSome studios have vanity plates that are recognized everywhere. The moment you see a ring of stars swirling into place above a serene-looking mountain, for example, you know you're looking at a Paramount production. That little kid who tosses a fishing line into the water while sitting in the crook of the moon is instantly recognizable as DreamWorks. Such logos, once they climb to a certain point of universal recognition on the movie screens, are a sure fire form of brand name recognition.\nEvery once in a while, though, a creator will have fun with it. The Vanity Plate will be changed in some way, just enough to put a new spin on it usually being tied into the movie it's featured in. Match Cuts are also a common form of this. More rarely, the logo will show up in a scene in the middle of the show.\nMore examples are located at Logopedia and the Closing Logos Group.\n\n",
        "example": " A Bridge Too Far originally began with a sepia-toned United Artists hexagon.\n",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/imax_kong.png"
    }
]