[
    {
        "trope_id": "t09707",
        "ratio": 2.25,
        "trope": "HamAndCheese",
        "description": "\nSay you're an actor and a damn good one at that. You're hot stuff in Hollywood, with directors throwing money at your feet to be in their film. So you pick the one that gets you the most cash or sounds the most promising in general. It'll all be fine, right?\nWrong.\nYou arrive on set to find what seems to be a film Gone Horribly Wrong, complete with Special Effects Failure, bad actors and a worse script. So what do you do? You could go \"Screw This, I'm Outta Here!\", storm off and refuse to associate with the film ever again, you could take the film seriously, try with all your might to make it work...or you could unleash The Hog, milk the giant cow dry, and chew the scenery into dust.\nIf it's going to be a well-remunerated bad movie, you might as well enjoy yourself, eh? And who knows? You might even end up saving the film.\nYou may notice that these performances tend to appear in tandem with ones that Took the Bad Film Seriously if only because they are such obvious Foils for each other. Also, compare One-Scene Wonder; both roles\/actors in these films play memorable, often over-the-top enjoyable performances and can make them one of the best parts of a film. Compare the Rule of Sean Connery; the rule often applies to actors who know exactly when to serve up the Ham and Cheese.\nCan overlap with WTH, Casting Agency? and Awesome, Dear Boy. Compare Chewing the Scenery, Wag the Director. Contrast Took the Bad Film Seriously.\nNOTE: This is not for listing hammy roles in good or even decent works. For the ham without the cheese, see tropes such as Large Ham and Incoming Ham for good alternates.\n",
        "example": " Alien: Resurrection is often considered one of the sillier entries in the Alien franchise, and has Ron Perlman, J.E. Freeman and Brad Dourif invoking this trope.\n",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/DELICOIUS_8192.png"
    },
    {
        "trope_id": "t13015",
        "ratio": 2.0,
        "trope": "LiveActionAdaptation",
        "description": "\nIn the West, many animated series have to run against the Animation Age Ghetto; one way to get around this and attract a wider audience is to do a live-action version of something originally animated. Even if it utilizes CG and special effects, this will sometimes strip the show of its perceived \"cartoonishness\". This is also a common device when a live-action movie adaptation is made, which will already be accused of leeching ideas from an older show.\nDepending on how the adaptation is done, it may be successful. However, some suffer from Conspicuous CG and end up the film equivalent of a Porting Disaster.\nA noticeable example is the Super Hero genre, where the outlandish, colorful nature of the genre seems most fitted for animated form. Yet despite animation gaining a bit more respect nowadays, most theatrical adaptations of superheroes are live-action, with varying levels of success.\nOne thing that has dramatically changed since the CGI creation of dinosaurs in Jurassic Park is the ability to visualize things that would have only been realistically possible in animation, such as Humongous Mecha.\nContrast Animated Adaptation.\n",
        "example": " The Fairly OddParents!  A Fairly Odd Movie: Grow Up, Timmy Turner!. Starring Drake Bell as a twenty-three-year-old Timmy Turner still in the fifth grade; he still has his fairies due to acting like a kid since if he does, he gets to keep them. However, Timmy winds up falling in love with a beautiful, twenty-three-year-old Tootie, who threatens to break them apart since it's a rather adult thing for which fairies aren't needed. The movie was so popular that it got two sequelsone about Christmas summer vacation and the other about summer vacation, except it ends up with Timmy becoming a fairy at the end. This was yet another in a long line of attempts to bring an end to the series.\n",
        "img_url": "https://mediaproxy.tvtropes.org/width/1200/https://static.tvtropes.org/pmwiki/pub/images/runaways_hulu.png"
    },
    {
        "trope_id": "t13065",
        "ratio": 1.6666666667,
        "trope": "LoadsAndLoadsOfCharacters",
        "description": "A show that has so many regulars that you can't fit them all into one episode. Therefore, one week some characters will appear, while some different characters will appear in another. You'll rarely get the same combination twice. This is especially common in Long-Runners, as characters tend to accumulate over time. Shows with this many characters tend towards one-dimensional characterization for many of them (but not always, if the writers will put in the effort), and often make filler easy to create.\nSimilarly, some video games involve collecting as many distinct, unique soldiers for your army as possible. Other video games, such as fighting games, start with just a few characters but keep adding characters to the roster as more sequels come out, until you eventually have enough characters to populate an entire Verse.\nCreating a Cast of Snowflakes with these loads is an achievement and will make the story lively and colorful. If the writers are smart, they'll start making a Cast Herd. The Love Dodecahedron is a way to spice things up, the Geodesic Cast makes use of the characters through variations on a theme, and The Clan happens when the loads are related. A Character-Magnetic Team can sometimes create this effect. Gets really convoluted if everyone is somehow related.\nPlease note that this is for extreme examples of regularly occurring characters. It's really not all that uncommon for a story to have ten or fifteen characters, especially with a Villain of the Week format.\nThis can cause crediting issues for shows with an OBB (opening billboard), leading to Fake Guest Star or being shunted into the Closing Credits for logistical reasons.\nSee also Crowded Cast Shot. May result in\/from You All Share My Story. Can contribute to Continuity Lockout in Long-Runners. Compare Revolving Door Casting and Heroes Unlimited. The inversion of this trope is Minimalist Cast. We have an article on how to write this variety of character roster.\n\n",
        "example": " Lester Burnham, Carolyn Burnham, Jane Burnham, Colonel Frank Fitts, Barbara Fitts, Ricky Fitts, Angela Hayes, Buddy Kane, Jim Olmeyer, and Jim Berkley. No, none of these are just filler characters—each of them plays a crucial role in the plot, or in someone else's characterization.",
        "img_url": "https://mediaproxy.tvtropes.org/width/1200/https://static.tvtropes.org/pmwiki/pub/images/friendz.png"
    },
    {
        "trope_id": "t00271",
        "ratio": 1.6666666667,
        "trope": "AdaptationOriginConnection",
        "description": "In an adaptation of a work, it's common to make the iconic Arch-Enemy of the source material into the adaptation's Big Bad. Due to Rule of Drama, this character will be tied into the hero's origin story, whether they were in the original work or not. A common variation is that the villain is the one who killed a loved one in their Death by Origin Story, making the villain a Composite Character with the Token Motivational Nemesis. Often revealed at the end, leading to the hero to decide that It's Personal.\nThe reasons for this are similar to those behind Superhero Movie Villains Die. Since the movie isn't necessarily an ongoing series, writers have a limited time to make the villain have as much impact as possible. It's a simple way of adding drama and a personal connection between the villain and the hero. Often Inverted such that a villain that wasn't a Create Your Own Villain in the original is made one in an adaptation.\nThis goes double for instances of Token Motivational Nemesis. Who is more interesting as the one who killed the hero's beloved teacher, love interest, or parents, some nameless thug or the iconic Big Bad?\nThis is the inverse of Create Your Own Villain, where the hero is involved in the origin story of the villain. Also compare to Related in the Adaptation, when an adaptation makes two previously unrelated characters family, and Meta Origin, where an origin story is given a specific underpinning that ties the characters' seemingly random power to a concrete phenomnena (and thus can connect them when they wouldn't have been in the source material).\n",
        "example": " Batman:\n In Tim Burton's first Batman film, it turns out that The Joker was, in fact, the man who killed Bruce Wayne's parents rather than Joe Chill.\n In an early draft, he was going to be the killer of Robin's parents as well.\n In Batman Forever, this happens by way of Composite Character, as the Dick Grayson version of Robin sees his circus acrobat parents killed by Two-Face instead of Tony Zucco. This makes him a bit like Jason Todd in the Post-Crisis comics, whose gangster father was murdered by Two-Face.\n Also the Riddler in the same film  Edward Nygma really has nothing to do with Bruce Wayne or his company in the comics, but in Forever Nygma was originally an employee of Wayne Enterprises and has Bruce as his entire motivation.\n Batman Begins, Ra's Al-Ghul (and the League of Shadows) was actually the one who trained Bruce Wayne in the ninja techniques that he uses as Batman. In the comics, Ra's had nothing to do with Bruce's origin or training, though he was a great foe. Also, while Ra's was training Bruce, he was under the alias Henri Ducard, who was an actual character in the comics and one of Bruce's many teachers.\n In Joker, Arthur Fleck's (AKA the Joker's) actions are indirectly responsible for the murder of Bruce's parents by Joe Chill, who was inspired by Arthur's on-screen murder of Murray Franklin to kill the Waynes for being a part of the wealthy elite. There's also the possibility that Arthur is Bruce's half-brother.\n",
        "img_url": "https://mediaproxy.tvtropes.org/width/1200/https://static.tvtropes.org/pmwiki/pub/images/batman_1989_poster.jpeg"
    },
    {
        "trope_id": "t24127",
        "ratio": 1.5714285714,
        "trope": "TookTheBadFilmSeriously",
        "description": "Despite their best wishes, every performer who is not John Cazale will end up acting in at least one bad movie in their career.note For those who don't know, John Cazale appeared in six movies before he died from cancer. All six were nominated for Best Picture, and three of them won. Some are wise enough to notice this going in, and decide to have fun while getting paid for it (lucky bastards). Not this guy though. They act with sincerity and conviction for an overproduced, over-hyped, and shoddily written movie.\nThe reasons for this vary: they may have extreme professionalism in every role they take to keep their reputation, they could be desperate to prove something (either a young actor who's still new or someone Playing Against Type desperate to show they're able to play multiple parts), there was Executive Meddling afterwards that hurt the film, or they honestly couldn't tell from ground level that the movie wasn't True Art but a glorified B-Movie.\nThe net effect is very Narmlike, with audiences becoming amused that this guy is putting so much effort into a flat role for a dud movie. This makes the actor\/character stand out and seem out of place: they aren't like the other bad actors on set with their dull detachment, but they aren't hamming it up either. They may even seem to be overacting by comparison because they're the only ones really acting. If enough of the cast do it, the movie itself may become So Bad, It's Good as it crosses the threshold from bad to surreal with actors giving Oscar grade performances for a throwaway summer Action Movie. On the other hand, this trope can very occasionally make the movie worth watching solely for the actor's performance, if it is good enough. He or she might even rescue the film from being So Bad, It's Horrible.\nThis is the cousin of Ham and Cheese, which features a Large Ham in a bad movie. This trope, by contrast, has a serious performance in a bad movie.\n",
        "example": " Kate Winslet in A Kid in King Arthur's Court, as one of the two princesses and the Black Knight.\nThe Nostalgia Critic: Don't try to class up this movie, lady, it's not worth it.\n",
        "img_url": "https://mediaproxy.tvtropes.org/width/1200/https://static.tvtropes.org/pmwiki/pub/images/christopherlee1.png"
    }
]