[
    {
        "trope_id": "t10595",
        "ratio": 7.0,
        "trope": "HotScientist",
        "description": "Or, if you're feeling punny, a Test Tube Babe.\nMore a staple of movies (especially science fiction), but also appears regularly on TV. When a male protagonist needs to consult with or bring in an expert on some obscure and\/or technical subject (poisonous orchids, particle theory, rare diseases, ancient languages, prehistoric sharks, whatever), said expert will turn out to be female, drop dead gorgeous, and, at twentysomething, conspicuously too young to have possibly earned the relevant academic degrees or otherwise accrued such expertise (often this is handwaved by mentioning at some point that she was a Teen Genius). Not all of these are required, but the general gist is good enough.\nThe reason why this trope is popular is because men want a woman who can tell them about Lagrange points and do a lap-dance. Preferably both at the same time.\nIf the word \"model\" appears anywhere on The Other Wiki's entry on their actor, you're definitely dealing with one.\nA Hot Scientist is frequently a Hot Librarian as well, and often ends up as a Girl of the Week or Temporary Love Interest. She may also be an Action Girl in a Badass Longcoat. Alternately, if she's not really a scientist she may be a Science Hero's Babe Assistant.\nFemale protagonists, on the other hand, often get saddled with a Horny Scientist. This trope seems to be increasingly less Always Female, however. In Japanese media, especially the genres aimed at a female audience, expect to see pretty boys with PhDs as well.\nPlease note that this applies to a character, not simply any hot actor playing a scientist, for the same reason Real Life examples are not listed here. Most actors are \"hot\" in the first place, so it usually goes unsaid. You can have an attractive scientist without their hotness being a plot element in the work - that would not fall under \"Hot Scientist\".\nCompare Hollywood Nerd and Nerds Are Sexy. See also Hackette, Hospital Hottie, Fair Cop and Wrench Wench.\n\n\n",
        "example": " Dr. Meridian is an unapologetic comic stereotype. Though WB fought against casting Kidman in the movie, on the grounds that  she apparently isn't sexy enough (?).",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/sttng_cast.jpg"
    },
    {
        "trope_id": "t24127",
        "ratio": 4.5,
        "trope": "TookTheBadFilmSeriously",
        "description": "Despite their best wishes, every performer who is not John Cazale will end up acting in at least one bad movie in their career.note For those who don't know, John Cazale appeared in six movies before he died from cancer. All six were nominated for Best Picture, and three of them won. Some are wise enough to notice this going in, and decide to have fun while getting paid for it (lucky bastards). Not this guy though. They act with sincerity and conviction for an overproduced, over-hyped, and shoddily written movie.\nThe reasons for this vary: they may have extreme professionalism in every role they take to keep their reputation, they could be desperate to prove something (either a young actor who's still new or someone Playing Against Type desperate to show they're able to play multiple parts), there was Executive Meddling afterwards that hurt the film, or they honestly couldn't tell from ground level that the movie wasn't True Art but a glorified B-Movie.\nThe net effect is very Narmlike, with audiences becoming amused that this guy is putting so much effort into a flat role for a dud movie. This makes the actor\/character stand out and seem out of place: they aren't like the other bad actors on set with their dull detachment, but they aren't hamming it up either. They may even seem to be overacting by comparison because they're the only ones really acting. If enough of the cast do it, the movie itself may become So Bad, It's Good as it crosses the threshold from bad to surreal with actors giving Oscar grade performances for a throwaway summer Action Movie. On the other hand, this trope can very occasionally make the movie worth watching solely for the actor's performance, if it is good enough. He or she might even rescue the film from being So Bad, It's Horrible.\nThis is the cousin of Ham and Cheese, which features a Large Ham in a bad movie. This trope, by contrast, has a serious performance in a bad movie.\n",
        "example": " Kate Winslet in A Kid in King Arthur's Court, as one of the two princesses and the Black Knight.\nThe Nostalgia Critic: Don't try to class up this movie, lady, it's not worth it.\n",
        "img_url": "https://mediaproxy.tvtropes.org/width/1200/https://static.tvtropes.org/pmwiki/pub/images/christopherlee1.png"
    },
    {
        "trope_id": "t01563",
        "ratio": 3.5,
        "trope": "AutoErotica",
        "description": "\nTwo characters have sex in the back seat of a car. Extra points if it's at somewhere referred to as \"Make-Out Point\".\nMoral or divine punishment for Auto Erotica (particularly at an isolated Make-Out Point) often manifests itself in the form of a Serial Killer on a prison break looking for fresh meat, a cop making his rounds, or an overprotective knight templar father armed with a shotgun or a baseball bat and out to defend his daughter's purity.\nTruth in Television, obviously — the romantic potentials of cars have been recognized from the beginning of the automotive age. The Edwardians dubbed them \"brothels-on-wheels\".\nNot to be confused with sexual attraction\/relationships with cars, robots, or vacuum cleaners, sexy people posing on the outside of cars, (or actual autoerotica). It is also not to be confused with Car Porn (where the porn is metaphorical).\nOften accompanied with Don't Come A-Knockin'.\nCompare Mile-High Club (having sex in an airplane in flight).\n",
        "example": " Ant and his hook up in the car.  While his friend gets beat up by a drug dealer, no less.",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/the_chase.png"
    },
    {
        "trope_id": "t01500",
        "ratio": 2.5,
        "trope": "AttackOfTheTownFestival",
        "description": "A common plot in Attack of the Killer Whatever movies. The town that is under attack happens to be holding a festival. Generally this is accompanied by an official that refuses to cancel the town festival for economic reasons. This in turn puts the public at risk and the hero of the story now has a whole town to protect from the fearsome people-eating whatever.\nBonus points if the festival in question features some theme, object or commodity (besides potential victims) which would naturally attract the Killer Whatever. Double bonus points if the festival is a masked event, and the attackers are taken as masks by the members of the public (until they are being eaten, that is) and become a Needle in a Stack of Needles for the heroes.\nIn many a fantasy rpg, this trope often overlaps with Doomed Hometown, with the doom in question (usually an invading horde of mooks working for the Big Bad) falling upon the town during a local festival.\nSee also Horror Doesn't Settle for Simple Tuesday for the holiday variant. Not to be confused with A Fête Worse Than Death, where the festival is itself the threat.\n",
        "example": " Batman (1989). The Gotham 200th Anniversary Festival is in trouble because people are scared of high crime in the city, and the conflict between the Joker and the gangsters and the Joker's poisoning of the population make it worse. Despite all this, the mayor insists that the Festival must occur so businesses will come back to the city.\n Eventually, the mayor does give in when it becomes obvious that it's simply too dangerous to hold a festival... which is The Joker's cue to pick up the slack. And he's giving out free money! Why, how could that hurt anyone?\n",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/humanoids_from_the_deep_blu_ray_steelbook.jpg"
    },
    {
        "trope_id": "t00593",
        "ratio": 2.5,
        "trope": "AlliterativeName",
        "description": "\nIn Real Life an alliterative name is a name in which the first and last names begin with the same letter. In more extreme cases, this can also include the middle name.\nGiving a character an alliterative name is one of many ways a writer can make a name more interesting and catchy, which in turn makes the character more memorable to the audience. This is especially important in works with Loads and Loads of Characters, where extra help is needed to differentiate between them.\nIn comic books, this is especially true of the names of Super Heroes or their close hangers-on. It was a favorite tool of Stan Lee's, since, swarmed with projects, he often had trouble remembering the characters' names, and the alliteration worked as a mnemonic device. (Though it didn't always work perfectly — Lee occasionally referred to \"Peter Palmer\" and \"Bob Banner\".)\nOf note to writers: Overusing this trope dilutes its effect, particularly if multiple characters have the same starting letters in their names.\nIn comic books, the Alliterative Name is often also Two First Names. In cartoons, it goes hand-in-hand with Species Surname.\nSee Alliterative Title, for work titles that do this.\nPlease note that Japanese names, though many may seem alliterative to an English-speaking audience, may not convey the same \"alliterative power\" in their original setting; syllables (and vowel sounds) matter more than letters in Japanese.\nWhile Truth in Television, this is way too common, so no Real Life examples.\n",
        "example": " Kit Keller and Mae Mordibito",
        "img_url": "https://mediaproxy.tvtropes.org/width/1200/https://static.tvtropes.org/pmwiki/pub/images/aacrcane_9.png"
    }
]