[
    {
        "trope_id": "t29457",
        "ratio": 1.6666666667,
        "trope": "SlasherFilm",
        "description": "Near-indestructible Serial Killers stalking attractive young girls, a combination that allows for buckets of gore and enough flesh to titillate.\nThe killers, mostly driven by revenge, are Made of Iron, at a minimum, and usually Implacable. Many are explicitly supernatural. All of them can appear and disappear as if by magic, and the corpses of their victims are equally elusive. A slasher killer can whisk away a full grown adult's corpse in seconds, leaving not a single drop of blood behind, or swiftly arrange all its victims in an elaborate tableau, without ever being seen lugging the dead bodies around. The more explicitly supernatural killers will have powers ranging from Super Strength (all the better to pull victims through walls), the ability to appear in dreams and attack the dreamers, or other ghostly abilities.\nThe victims are usually teenagers or young adults, all usually guilty of some minor vice. Once the audience has had a convincing demonstration of their (usually sexual) misdemeanours, they are spectacularly slaughtered. If there's more than one sin or minority to pick from then the Sorting Algorithm of Mortality comes into play.\nEventually, there will be only one girl left standing, the Final Girl, normally the only \"morally pure\" member of the main cast. With considerable help from her death battle exemption, she will kill the killer.\nCome the next sequel, it will be revealed that the killer was actually Not Quite Dead, or in some cases, inspired someone to take up their mantle.\nA subset of the Horror genre, although the schlockier examples replace suspense almost entirely with gore. They are often considered B-movies.\nThe history of slashers can be divided into several distinct waves. Alfred Hitchcock's Psycho is often cited as having a direct influence over the genre by introducing sympathetic characters that are unexpectedly murdered during the course of film, along with pushing the boundaries of sex and violence. The genre also has its roots in giallo films, a genre of Italian murder mysteries which rose to popularity in The '60s and The '70s, best known for their then-groundbreaking use of bloody violence and steamy sexuality. Many famed Italian directors, like Dario Argento, Lucio Fulci, and Mario Bava, began their careers in the giallos, directing classic horrors like Reazione a Catena and Deep Red. The earliest American (and Canadian) slashers, like The Texas Chain Saw Massacre (1974), Black Christmas (1974), Alice, Sweet Alice, and The Town That Dreaded Sundown, were carved directly out of the giallo mold.\nAfter steadily rising in popularity throughout the 1970s, slashers finally exploded into the mainstream in 1978, when the genre's Trope Codifier in the form of John Carpenter's Halloween landed in theatres and became a massive smash hit. Looking to cash in on its success, film producer Sean S. Cunningham created the original Friday the 13th (1980), and once it too hit the big time, slashers were here to stay. A deluge of copycats, including sequels to Halloween and Friday the 13th, flooded theaters throughout the first half of the 1980s, from Prom Night (1980) to My Bloody Valentine to The Burning, and just when the craze seemed ready to die, A Nightmare on Elm Street arrived in 1984 and brought in a supernatural element to the proceedings. It wasn't until the final years of the 80s that slashers finally burned out, as the established franchises grew stale and the ripoffs grew more desperate, but it wouldn't be for long.\n1996's Scream, directed by Nightmare on Elm Street creator Wes Craven, satirized the genre - while remaining a genuinely scary thriller - and became a big hit. Once again, studios sought to cash in on the film's success, and began the second wave of slashers, with films like I Know What You Did Last Summer, Urban Legend, and Valentine. These movies stood in rather stark contrast to their 80s brethren- good writing and characterization, considered disposable (and usually nonexistent) in the first era, were now all-important, as the plots now focused on the heroes trying to stay one step ahead of the criminals (who often based their murders on famous stories or past events in the good guys' lives) while also navigating their personal relationships, which - as teenage lives tend to be - were fraught with conflict and melodrama. The genre again petered out by the end of the 90s, thanks to parodies like Scary Movie as well as the rise of the J-Horror and Torture Porn flicks that dominated the following decade, but once again, it wouldn't be for long.\nBy the back half of the '00s, nostalgia for the original era of slashers began to rise (piggybacking on the usual way pop-culture nostalgia tends to be Two Decades Behind), and with nostalgia comes remakes. The Texas Chainsaw Massacre (2003), Halloween (2007) and Friday the 13th (2009) all returned, and a whole flood of new slashers, both remakes and original movies, followed once again in their wake. Now, in The New '10s, it seems as though slashers are here to stay, with films like A Nightmare on Elm Street (2010), You're Next, Hatchet, and Tucker  Dale Vs. Evil able to safely co-exist with the more popular ghost- and demon-themed chillers of the decade. Time will tell if it stays that way.\nRoger Ebert called these movies \"Dead Teenager Movies\" due to their focus on teenagers getting killed. Another popular nickname is \"Bodycount Films\/Movies\".\nKeep in mind that, while every slasher movie features a serial killer or a spree killer, not every serial killer or spree killer movie is a slasher movie. Also note that a slasher film is quite different from a Psychological Thriller, which tends to emphasize the Sympathy for the Devil part using a Freudian Excuse or two (and possibly a few Pet the Dog moments in the killer's favor), and de-emphasize the Final Girl, often killing off all characters.\nWant to write your own slasher flick? We have a handy writer's guide for anybody looking to do just that.\n",
        "example": " A Day of Judgment\n",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/theprowler_prowling_7652.jpg"
    },
    {
        "trope_id": "t20514",
        "ratio": 1.6666666667,
        "trope": "SlasherMovie",
        "description": "Near-indestructible Serial Killers stalking attractive young girls, a combination that allows for buckets of gore and enough flesh to titillate.\nThe killers, mostly driven by revenge, are Made of Iron, at a minimum, and usually Implacable. Many are explicitly supernatural. All of them can appear and disappear as if by magic, and the corpses of their victims are equally elusive. A slasher killer can whisk away a full grown adult's corpse in seconds, leaving not a single drop of blood behind, or swiftly arrange all its victims in an elaborate tableau, without ever being seen lugging the dead bodies around. The more explicitly supernatural killers will have powers ranging from Super Strength (all the better to pull victims through walls), the ability to appear in dreams and attack the dreamers, or other ghostly abilities.\nThe victims are usually teenagers or young adults, all usually guilty of some minor vice. Once the audience has had a convincing demonstration of their (usually sexual) misdemeanours, they are spectacularly slaughtered. If there's more than one sin or minority to pick from then the Sorting Algorithm of Mortality comes into play.\nEventually, there will be only one girl left standing, the Final Girl, normally the only \"morally pure\" member of the main cast. With considerable help from her death battle exemption, she will kill the killer.\nCome the next sequel, it will be revealed that the killer was actually Not Quite Dead, or in some cases, inspired someone to take up their mantle.\nA subset of the Horror genre, although the schlockier examples replace suspense almost entirely with gore. They are often considered B-movies.\nThe history of slashers can be divided into several distinct waves. Alfred Hitchcock's Psycho is often cited as having a direct influence over the genre by introducing sympathetic characters that are unexpectedly murdered during the course of film, along with pushing the boundaries of sex and violence. The genre also has its roots in giallo films, a genre of Italian murder mysteries which rose to popularity in The '60s and The '70s, best known for their then-groundbreaking use of bloody violence and steamy sexuality. Many famed Italian directors, like Dario Argento, Lucio Fulci, and Mario Bava, began their careers in the giallos, directing classic horrors like Reazione a Catena and Deep Red. The earliest American (and Canadian) slashers, like The Texas Chain Saw Massacre (1974), Black Christmas (1974), Alice, Sweet Alice, and The Town That Dreaded Sundown, were carved directly out of the giallo mold.\nAfter steadily rising in popularity throughout the 1970s, slashers finally exploded into the mainstream in 1978, when the genre's Trope Codifier in the form of John Carpenter's Halloween landed in theatres and became a massive smash hit. Looking to cash in on its success, film producer Sean S. Cunningham created the original Friday the 13th (1980), and once it too hit the big time, slashers were here to stay. A deluge of copycats, including sequels to Halloween and Friday the 13th, flooded theaters throughout the first half of the 1980s, from Prom Night (1980) to My Bloody Valentine to The Burning, and just when the craze seemed ready to die, A Nightmare on Elm Street arrived in 1984 and brought in a supernatural element to the proceedings. It wasn't until the final years of the 80s that slashers finally burned out, as the established franchises grew stale and the ripoffs grew more desperate, but it wouldn't be for long.\n1996's Scream, directed by Nightmare on Elm Street creator Wes Craven, satirized the genre - while remaining a genuinely scary thriller - and became a big hit. Once again, studios sought to cash in on the film's success, and began the second wave of slashers, with films like I Know What You Did Last Summer, Urban Legend, and Valentine. These movies stood in rather stark contrast to their 80s brethren- good writing and characterization, considered disposable (and usually nonexistent) in the first era, were now all-important, as the plots now focused on the heroes trying to stay one step ahead of the criminals (who often based their murders on famous stories or past events in the good guys' lives) while also navigating their personal relationships, which - as teenage lives tend to be - were fraught with conflict and melodrama. The genre again petered out by the end of the 90s, thanks to parodies like Scary Movie as well as the rise of the J-Horror and Torture Porn flicks that dominated the following decade, but once again, it wouldn't be for long.\nBy the back half of the '00s, nostalgia for the original era of slashers began to rise (piggybacking on the usual way pop-culture nostalgia tends to be Two Decades Behind), and with nostalgia comes remakes. The Texas Chainsaw Massacre (2003), Halloween (2007) and Friday the 13th (2009) all returned, and a whole flood of new slashers, both remakes and original movies, followed once again in their wake. Now, in The New '10s, it seems as though slashers are here to stay, with films like A Nightmare on Elm Street (2010), You're Next, Hatchet, Tucker  Dale Vs. Evil, and It (2017) able to safely co-exist with the more popular ghost- and demon-themed chillers of the decade. Time will tell if it stays that way.\nRoger Ebert called these movies \"Dead Teenager Movies\" due to their focus on teenagers getting killed. Another popular nickname is \"Bodycount Films\/Movies\".\nKeep in mind that, while every slasher movie features a serial killer or a spree killer, not every serial killer or spree killer movie is a slasher movie. Also note that a slasher film is quite different from a Psychological Thriller, which tends to emphasize the Sympathy for the Devil part using a Freudian Excuse or two (and possibly a few Pet the Dog moments in the killer's favor), and de-emphasize the Final Girl, often killing off all characters.\nWant to write your own slasher flick? We have a handy writer's guide for anybody looking to do just that.\n",
        "example": " A Day of Judgment\n",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/theprowler_prowling_7652.jpg"
    },
    {
        "trope_id": "t23533",
        "ratio": 1.5,
        "trope": "TheStoner",
        "description": "\nThe male version of the Granola Girl. The stoner is generally a comical character who smokes, gets beat up, makes bad jokes, and suffers other sorts of Butt-Monkey type things, only with more drugs. The most likely character to get a Mushroom Samba bit. He is basically a cross between Butt-Monkey and the Wacky Guy. Usually somewhere between a technical and an Actual Pacifist, and almost always entirely non-threatening, in physical appearance. May very occasionally be prone to getting dangerous, but only rarely and under truly exceptional circumstances.\nThe stoner is very similar to the 19th Century \"funny drunk.\" However, that became a Discredited Trope as groups like AA and MADD gained influence. The modern stereotype is that drunks are likely to beat you up, while stoners aren't, so stoners make better comedy. When played for drama, they are likely to be burnout losers living dead-end lives with no ambition or meaningful aspirations beyond getting high.\nNot to be confused with The Atoner. One key away means a whole different thing...\nMay evolve into an Erudite Stoner. See also The Slacker and Surfer Dude for G-rated examples.\n\n",
        "example": " Mitch comes off as either this or a suffer of a decades-long  Heroic BSoD .",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/the_stoner.jpg"
    },
    {
        "trope_id": "t15980",
        "ratio": 1.5,
        "trope": "OffWithHisHead",
        "description": "\nIf you're dealing with any sword-oriented media, whether it be fantasy, medieval, kung fu, or something else, and it's more violent than a PG-13 rating, chances are, someone is going to get his head chopped off (and it may not even need the R rating if you're dealing with nonhuman enemies). One of the most common methods of execution back in the medieval era next to hanging, decapitation is usually one of the surest ways to ensure someone is Deader Than Dead barring some very potent magic or divine intervention. Indeed, in Real Life, it is one of the very few ways that death can be instantly diagnosed.\nAny Ridiculously Human Robot (even one with a Cranial Processing Unit) or other decidedly inhuman being will probably be capable of surviving decapitation, and will do so at some point either for a joke or as a plot point. In less serious series, the body will even continue to walk around bumping into things like a chicken or a cockroach with its head cut off.\nIt is nearly always depicted as being surprisingly easy to cut through someone's whole neck and spinal column, even in one blow to a moving target. While Anne Boleyn did get beheaded with one stroke, most pre-guillotine beheadings took at least three strokes. Boleyn's executioner was—by request—a professional swordsman who would know how to cleanly behead someone. And that's when the target is helpfully restrained; in an actual Sword Fight it would have been even harder to pull off and would also have been serious overkill. A direct cut through the skull into the brain—or a strike to the neck that would at least sever critical blood vessels or the windpipe if it didn't cut through the spine—was usually more expedient.\nThis trope is named after the line Off with his head; — so much for Buckingham from Colley Cibber's adaptation of Richard III. The trope was also famously used by the Queen of Hearts in Lewis Carroll's Alice's Adventures in Wonderland. See also Your Head A-Splode for a much gorier version of this trope and Boom, Headshot! when it comes to firearms.\nMay result in a Human Head on the Wall.\nAlso see Alas, Poor Yorick, Decapitation Presentation and Severed Head Sports. When cutting off the head is the only way to kill something, it's Decapitation Required. If the decapitated head is somehow still alive after the fact for any notable length of time, that's Losing Your Head.\nNot to be confused with a Decapitation Strike, which is about decapitating a whole faction rather than just some person.\nAs per being a death trope, EXPECT UNMARKED SPOILERS!!!\n",
        "example": " In Alice in Murderland, Tiffany is murdered by being decapitated.\n",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/2012_10_24_level6_41_b5c8d0e8.png"
    },
    {
        "trope_id": "t16796",
        "ratio": 1.25,
        "trope": "PeekABooCorpse",
        "description": "The heroine has just escaped from the Serial Killer or the gruesome corporeal manifestation of the Cosmic Horror and is running through the Haunted House, desperately trying to find a means of escape. She's managed to avoid tripping over her own feet and falling like an idiot, and if she can just make it through this next upcoming door, she may just be able to make it to the outside world and sweet, sweet freedom!\nShe opens the door... only to find herself standing nose to nose with a decayed, maggoty, slack-jawed corpse...\nCue Scare Chord. Cue also a huge scream from the heroine and from any traumatized 8-year olds who may have the misfortune to be watching this show.\nYes. Once again, the Peek-a-Boo Corpse — the bane of squeamish horror movie watchers everywhere — has made an appearance, rearing its ugly, eyeless, wormy head and worming its way into the nightmares of kids and adults alike.\nIf you're a naive moviewatcher (e.g., a child), there is no defense from the Peek-a-Boo Corpse, for there is no way to see it coming. Even if you've had some experience watching horror movies (and you can pretty much tell if a desperate Damsel in Distress is going to run into trouble), there are still times and places when the Peek-a-Boo Corpse will pop out unexpectedly, scaring the bejeezus out of even the most hardened of horror fans, especially if it's a particularly hideous one. Most Peek-a-Boo Corpses like to hang around haunted houses and cemeteries, but occasionally they'll turn up in clean and innocuous environments where you'd least expect them (and where they'll have maximum shock value). A common way to find out if an ordinary, non-suspicious character is actually a villain is to have the heroine stumble upon a Peek-a-Boo Corpse hidden in their closet or basement. (Unfortunately, for the heroine, the villain is usually close by, watching this development, if they're not actively chasing her already.)\nYou can expect the identity of the Peek-a-Boo Corpse to be:\nIn order for a body to qualify as a Peek-a-Boo Corpse , its appearance must somehow jolt the viewer and the person finding it should either be (a) actively engaged in a search for something else or (b) running to escape some real or perceived danger. Note: In the event that the half-destroyed corpse-like body of the villain should pop out and scare the heroes after they had mistakenly thought that they had laid it to rest, it technically doesn't qualify as a Peek-a-Boo Corpse moment (the main reason being that... well... the villain isn't entirely a corpse yet...)\nCompare Cat Scare and Spring-Loaded Corpse. If the corpse playing peek-a-boo was hidden in an extremely odd location, that's Body in a Breadbox. If they were found on the ceiling, that's Ceiling Corpse.\n",
        "example": " ...  Hilarity Ensues  during the hospital clean-up.",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/PhantomManor.jpg"
    }
]