[
    {
        "trope_id": "t14255",
        "ratio": 2.5,
        "trope": "MisplacedNamesPoster",
        "description": "\nYou are looking at a film poster. There's the lineup of the movie's cast, or their floating heads, or their mirrored profiles. You look up at the names of the actors, and much to the annoyance of your inner neat freak, the names listed don't match up with the actors!\nWhy does this happen? Well, there could be a number of reasons. Maybe the text was laid out at a different time than the graphic. Maybe the actor's contracts stipulate whose name goes in which order (and the actor whose name comes first also has to be prominently in the middle of the poster). Maybe it was meant as some sort of joke. It could be that as is the convention for Hollywood posters, the highest paid or top-billed actor is displayed on the poster as the central figure in the image, and all lower-billed actors placed outward; whereas the names of the same actors are arranged in order of prominence from left to right.\nThere's also a rarer opening titles version, involving the credits not being aligned with the clips being shown, resulting in one actor's name appearing on top of footage of a completely different actor—often to the audience's confusion, if the cast members in question are not familiar names.\n",
        "example": " See the image above.",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/morning_glory.jpg"
    },
    {
        "trope_id": "t10401",
        "ratio": 0.5555555556,
        "trope": "HollywoodHomely",
        "description": "\nLet's say a storyline requires a character who is unappealing, unattractive, and has a hard time finding dates. However, unattractive or even average-looking actors (especially women) are virtually unknown and dissuaded from trying to get acting jobs in Hollywood, so the person cast is more gorgeous than most people you'd meet in real life. Producers know that \"beauty is money,\" and they're disinclined to cast genuinely unattractive people even as villains or extras, and would rather imply homeliness via character-reactions.\nCharacters are made \"plain\" by giving them thick glasses, braces, freckles, unfashionable clothes, an unflattering hairstyle, and surrounding them with people who are more attractive. A subtle method used is to give the actor clothes that clash with their natural skin color, making them look pale or blotchy, a method also used in \"before-and-after\" shots for diet-pill commercials. Bad lighting is also a good trick.\nNote: Just because a character is tormented by a vampy Alpha Bitch, it does not mean they're considered ugly in-universe (in fact - real life bullies can often hate rivals because they're jealous of their good looks). Likewise a character can be oblivious to their own good looks and have a poor self-image without being considered Hollywood Homely.\nSee also: Generic Cuteness is the animated equivalent of this trope, and the result is a very Informed Deformity. Adaptational Attractiveness, Beauty Inversion, I'm Not Pretty, Beautiful All Along, Cool Loser, Hollywood Dateless, Hollywood Nerd, and Hollywood Pudgy. Contrast Informed Attractiveness and Gorgeous Gorgon.\n",
        "example": " In Be Kind Rewind, Melonie Diaz's character, Alma, is played up as ugly when the male filmmakers are forced to take her over her more attractive sister. They achieve this by... having her sniff and rub her nose a couple of times. It's quickly forgotten and she's the hot girl for the rest of the movie. Especially egregious as she had just starred in A Guide to Recognizing Your Saints playing the neighborhood hottie.\n",
        "img_url": "https://mediaproxy.tvtropes.org/width/1200/https://static.tvtropes.org/pmwiki/pub/images/ugly_betty.png"
    },
    {
        "trope_id": "t28833",
        "ratio": 0.5,
        "trope": "HollywoodUgly",
        "description": "\nLet's say a storyline requires a character who is unappealing, unattractive, and has a hard time finding dates. However, unattractive or even average-looking actors (especially women) are virtually unknown and dissuaded from trying to get acting jobs in Hollywood, so the person cast is more gorgeous than most people you'd meet in real life. Producers know that \"beauty is money,\" and they're disinclined to cast genuinely unattractive people even as villains or extras, and would rather imply homeliness via character-reactions.\nCharacters are made \"plain\" by giving them thick glasses, braces, freckles, unfashionable clothes, an unflattering hairstyle, and surrounding them with people who are more attractive. A subtle method used is to give the actor clothes that clash with their natural skin color, making them look pale or blotchy, a method also used in \"before-and-after\" shots for diet-pill commercials. Bad lighting is also a good trick. The character may also be a Sickly Neurotic Geek.\nNote: Just because a character is tormented by a vampy Alpha Bitch, it does not mean they're considered ugly in-universe (in fact - real life bullies can often hate rivals because they're jealous of their good looks). Likewise a character can be oblivious to their own good looks and have a poor self-image without being considered Hollywood Homely. Beauty is very subjective in real-life, and this trope only counts if the character is considered unattractive by the majority in-universe.\nSee also: Generic Cuteness is the animated equivalent of this trope, and the result is a very Informed Deformity. Adaptational Attractiveness, Beauty Inversion, I'm Not Pretty, Beautiful All Along, Cool Loser, Hollywood Dateless, Hollywood Nerd, and Hollywood Pudgy. Contrast Informed Attractiveness and Gorgeous Gorgon.\n",
        "example": " In Be Kind Rewind, Melonie Diaz's character, Alma, is played up as ugly when the male filmmakers are forced to take her over her more attractive sister. They achieve this by... having her sniff and rub her nose a couple of times. It's quickly forgotten and she's the hot girl for the rest of the movie. Especially egregious as she had just starred in A Guide to Recognizing Your Saints playing the neighborhood hottie.\n",
        "img_url": "https://mediaproxy.tvtropes.org/width/1200/https://static.tvtropes.org/pmwiki/pub/images/ugly_betty.png"
    },
    {
        "trope_id": "t30492",
        "ratio": 0.5,
        "trope": "HollyWoodHomely",
        "description": "\nLet's say a storyline requires a character who is unappealing, unattractive, and has a hard time finding dates. However, unattractive or even average-looking actors (especially women) are virtually unknown and dissuaded from trying to get acting jobs in Hollywood, so the person cast is more gorgeous than most people you'd meet in real life. Producers know that \"beauty is money,\" and they're disinclined to cast genuinely unattractive people even as villains or extras, and would rather imply homeliness via character-reactions.\nCharacters are made \"plain\" by giving them thick glasses, braces, freckles, unfashionable clothes, an unflattering hairstyle, and surrounding them with people who are more attractive. A subtle method used is to give the actor clothes that clash with their natural skin color, making them look pale or blotchy, a method also used in \"before-and-after\" shots for diet-pill commercials. Bad lighting is also a good trick. The character may also be a Sickly Neurotic Geek.\nNote: Just because a character is tormented by a vampy Alpha Bitch, it does not mean they're considered ugly in-universe (in fact - real life bullies can often hate rivals because they're jealous of their good looks). Likewise a character can be oblivious to their own good looks and have a poor self-image without being considered Hollywood Homely. Beauty is very subjective in real-life, and this trope only counts if the character is considered unattractive by the majority in-universe.\nSee also: Generic Cuteness is the animated equivalent of this trope, and the result is a very Informed Deformity. Adaptational Attractiveness, Beauty Inversion, I'm Not Pretty, Beautiful All Along, Cool Loser, Hollywood Dateless, Hollywood Nerd, and Hollywood Pudgy. Contrast Informed Attractiveness and Gorgeous Gorgon.\n",
        "example": " In Be Kind Rewind, Melonie Diaz's character, Alma, is played up as ugly when the male filmmakers are forced to take her over her more attractive sister. They achieve this by... having her sniff and rub her nose a couple of times. It's quickly forgotten and she's the hot girl for the rest of the movie. Especially egregious as she had just starred in A Guide to Recognizing Your Saints playing the neighborhood hottie.\n",
        "img_url": "https://mediaproxy.tvtropes.org/width/1200/https://static.tvtropes.org/pmwiki/pub/images/ugly_betty.png"
    },
    {
        "trope_id": "t19071",
        "ratio": 0.44,
        "trope": "RomComJob",
        "description": "Still at loss about what to do with your life? Fret not - if you happen to find yourself in a romance\/comedy\/romantic comedy, you can follow this easy counselling guide for career enlightement. You do need a job, or you won't be able to afford the lifestyle that allows for luxurious abodes while spending most days solely mulling over romantic entanglements. But narrowing down the job options is very easy:\nWant to show your nurturing side? Become a doctor (especially if a male) or a teacher (especially if a female), to land an infinitely secure, respectable and satisfying job. Those jobs are character shorthand that tell every potential suitor that you are caring and non-threatening, adept at looking after others, i.e. good spouse\/family-making material - essential qualities in Rom Com.\nWant to be creative? Become anything where a normal person has miniscule opportunities to make an actual living - a photographer, illustrator, writer, designer of stuff, or choose one of the more creative jobs in media. You will still be guaranteed unprecedented success, big promotions and\/or rave reviews. Even if you're currently a starving artist who is still waiting for the breakthrough or just lazy, remember you're super talented and have unlimited potential! And the love of your life you've just met will thrust you in the right direction.\nCooking has enough creative elements to be applicable. As a bonus, it handily offers opportunities for romantic gestures - like creating meals in unusual locations - and hints to your special someone that you are family-ready. If you're man you should be a chef, if you're a woman try something smaller and cuter, like cupcakes. If you rather not physically create something yourself, become a hang-around to the cultured and creative: try event planning, advertising\/PR, music business, doing stuff at an art gallery, or running your own artsy corner shop.\nCreative jobs are useful in the Rom Com world, as they have a cool and glamorous ring to them, yet sound like there could be a decent expected income to support your prospective family. They have vague job descriptions and irregular hours which free you for the romance, and you get a chance to meet a variety of colorful characters (especially at places like art galleries and little corner shops). It doesn't hurt here that the typical writer-creator of the Rom Com world can pour in some of their insight of the creative business.\nWant money? Become a high-flying exec of an unspecified corporate entity or a lawyer without a good cause. This is character shorthand for you being a type-A workaholic who's married to their job and a total sell-out. Therefore, be prepared to change jobs ASAP to prove your creative or nurturing side (see: options 1 and 2) to your laidback love interest, as currently you work for Evil. Remember, if you're too good and efficient at what you do, bad things will follow, like dying.\nSo go ahead, pursue your chosen job, opportunities are practically endless! (Restrictions may apply.)\nCompare with Stock Superhero Day Jobs and Occupation Tropes. See also Most Writers Are Writers, One-Hour Work Week, Starving Artist, Love Tropes, Romantic Comedy.\n",
        "example": " A Lot Like Love - she's a photographer\n",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/csl_5.png"
    }
]