[
    {
        "trope_id": "t19325",
        "ratio": 5.0,
        "trope": "SassyBlackWoman",
        "description": "\nSince the era of Jim Crow and the Civil Rights Movement, black people were more visible and could be more outspoken — to a point, particularly if they were female. To illustrate this, sassy \"Mammy\" figures could scold the family they worked for and playfully berate their employers (so the authors could show that Blacks were not being oppressed). And because of the feminism movement, this was especially the case for black women. Combine these, and you get the sassy black woman. It started with the heroines of blaxploitation movies, like Coffy and Foxy Brown (both played by Pam Grier), and continued into the 1980s.\nShe's defined by her vivaciousness, humor and joie de vivre, and can make a good counterpoint to the more grim or snarky members of the cast. In complete contrast to her other variation, is not only a pleasure to be around, but is also so the go to girl for advice and help. These characters usually make good leaders, because though generally fun, insightful, they are still firm in decisions, trustworthy, and speak their minds. Also like the Spicy Latina, the character will usually be sexually liberated and have no qualms acting in a sexual manner, though usually in a less pronounced manner. The positive version is now portrayed a lot more than the negative version, mainly because of the Unfortunate Implications that portraying black women in only this way had. It's also rather common for the positive variant to be the Only Sane Woman of a group, in which case her \"sass\" will be more like \"exasperated sarcasm\".\nThe odds that she's a Fag Hag are directly proportionate to her weight. Arguably the Distaff Counterpart to the Scary Black Man, though she can be quite scary herself when pissed off. Might also be a white character's Black Best Friend. Close cousin to the Spicy Latina.\nThere is a variation on this, more subdued but no less expressive: the regal Deadpan Snarker, who will often be well-spoken and articulate, with a more highbrow vocabulary and a regal, imperious manner of expressing herself, but still willing to toss subtle (or unsubtle) barbs and make herself heard. Perhaps the best known of this \"African Queen\" variation is the X-Man Storm.\nNote that this trope might well be on its way to becoming a Discredited Trope - it's seen as stereotypical and lazy writing and people want to see minority characters given the same nuanced characterisation as anyone else.\n\n",
        "example": " Rhonda.",
        "img_url": "https://mediaproxy.tvtropes.org/width/1200/https://static.tvtropes.org/pmwiki/pub/images/sbw.png"
    },
    {
        "trope_id": "t09707",
        "ratio": 4.5,
        "trope": "HamAndCheese",
        "description": "\nSay you're an actor and a damn good one at that. You're hot stuff in Hollywood, with directors throwing money at your feet to be in their film. So you pick the one that gets you the most cash or sounds the most promising in general. It'll all be fine, right?\nWrong.\nYou arrive on set to find what seems to be a film Gone Horribly Wrong, complete with Special Effects Failure, bad actors and a worse script. So what do you do? You could go \"Screw This, I'm Outta Here!\", storm off and refuse to associate with the film ever again, you could take the film seriously, try with all your might to make it work...or you could unleash The Hog, milk the giant cow dry, and chew the scenery into dust.\nIf it's going to be a well-remunerated bad movie, you might as well enjoy yourself, eh? And who knows? You might even end up saving the film.\nYou may notice that these performances tend to appear in tandem with ones that Took the Bad Film Seriously if only because they are such obvious Foils for each other. Also, compare One-Scene Wonder; both roles\/actors in these films play memorable, often over-the-top enjoyable performances and can make them one of the best parts of a film. Compare the Rule of Sean Connery; the rule often applies to actors who know exactly when to serve up the Ham and Cheese.\nCan overlap with WTH, Casting Agency? and Awesome, Dear Boy. Compare Chewing the Scenery, Wag the Director. Contrast Took the Bad Film Seriously.\nNOTE: This is not for listing hammy roles in good or even decent works. For the ham without the cheese, see tropes such as Large Ham and Incoming Ham for good alternates.\n",
        "example": " Alien: Resurrection is often considered one of the sillier entries in the Alien franchise, and has Ron Perlman, J.E. Freeman and Brad Dourif invoking this trope.\n",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/DELICOIUS_8192.png"
    },
    {
        "trope_id": "t03839",
        "ratio": 2.5,
        "trope": "ClarkKenting",
        "description": "\nClark Kenting is the process by which a Secret Identity and\/or cover story is maintained over a long period of time by asking the audience to go along with a Paper-Thin Disguise. This is also asked of the other characters in the story, with no excuses, basically asking everyone to “just go with it.” For the most part, it’s a way to make it clear to the audience that the two identities are the same person, but people in-story can’t tell them apart.\nThe trope is named after Clark Kent, Superman's alter ego, who basically looks like Superman in a suit and glasses. However, Superman can actually pull it off to great effect, leading to the idea that sometimes the best way to maintain a Secret Identity is to hide it in plain sight. After all, if you're not wearing a mask, you have nothing to hide, right?\nCompare Paper-Thin Disguise. See also Cassandra Truth, Clark Kent Outfit, Cover-Blowing Superpower, Master of Delusion, Secret Identity Vocal Shift and Sarcastic Confession.\n\n",
        "example": "  Lampshaded . Aladdin points out that people will still recognize him if he marches into Agrabah wearing different clothes, but Genie points out that his magic is all about the charade and that'll keep people from identifying him. Ultimately downplayed when Jasmine and Jafar both eventually do recognize him, and Genie says that the magic doesn't mean people can't put two and two together.",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/clark_kenting_21.png"
    },
    {
        "trope_id": "t11614",
        "ratio": 2.5,
        "trope": "InsultToRocks",
        "description": "You want to tell someone else that they’re as dumb as a brick. But then you answer, that’s a terrible thing to say about bricks.\nMore generally, any insult following the form of ‘I’d call you an X, but that would be an insult to all X’s.’ Typically, X will be an inanimate object, or something detestable. ‘I’d call you a motherfucker, but it’d be demeaning to those guys who fuck their mothers.’ Using this latter form is like saying that the one being insulted is far worse and more worthy of contempt than the detestable X to which they’re being compared.\nAnother variant is acknowledging that at least X is much more worthy of some respect. ‘I’d call you an X, but then again I take it back because at least X is insert positive description here.’\nA third is to state the insult, and then apologize — to any X who felt insulted by the comparison.\nThis can also involve Self-Deprecation if the insulter notes their own negative qualities, then says how much worse the insultee is.\nSee also Even Evil Has Standards, My Friends... and Zoidberg, Bait-and-Switch Comparison, Insult Friendly Fire and Insult Misfire. If the insulter compares the insultee to an X, but the insultee notes positive qualities of X see Insult Backfire. May invoke Sympathy for the Devil.\n",
        "example": " Hopper's prejudice against ants is so great, he considers calling Flik a piece of dirt  an insult to dirt . Hopper   You piece of dirt... no, I'm wrong, you're  lower than dirt —you're an  ANT .",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/insult_to_rocks.png"
    },
    {
        "trope_id": "t15712",
        "ratio": 2.3333333333,
        "trope": "NotScreenedForCritics",
        "description": "\nSo it's Friday, and you're considering seeing this new movie that has just Opened In Theaters Everywhere. Before you do, you grab a copy of today's newspaper, and turn to the movie section, looking for a review. Or you check a site like Rotten Tomatoes or Metacritic to get both their combined metascore and the reviews that come with it.\nInstead of a review, you read a notice stating that the film was \"not screened for critics.\" The review compilation sites also have very few reviews and can't compute a review score from it. This is almost always a big warning sign about the quality of the movie. For the vast majority of movies that do this, they suspect that under normal circumstances, the reviewers would have seen the film already on DVD \"screeners\" or private showings, and would have had plenty of time to write witty, biting criticism (or just plain vituperation) that would have completely eviscerated it. The general indication is that the studio doesn't want people to be warned away from the movie prior to opening day.\nAnother tactic by studios is to allow critics to see a preview screening... with a bunch of contest winners, so that instead of being able to make notes and review a film in a quiet theater or purpose-built screening room, the critic has to do it in a crowded megaplex with people who probably wouldn't have seen the movie at all if they hadn't won free tickets and will probably like it only because they didn't have to pay to see it. Films aimed at kids and teenagers might get a rowdy and rambunctious audience throughout the entire film (worse if it features the Teen Idol of the moment). One of the actors or producers may even make a \"surprise\" personal appearance, taking away any sense of a neutral setting (are you going to tell them their film is awful in person?). Many critics thus will easily not take the bait and stay away in droves for their sanity.\nThis tends to happen a lot during the months of January, February, and late August - the traditional Dump Months where all the movies in which the studio no longer has faith but which it is contractually obligated to release get dumped, leaving the good months for Summer Blockbusters and Oscar Bait.\nThis happens with video games as well; most prominent review outlets tend to get copies of games early, and it's telling what the publisher thinks of a game if a website like IGN or Gamespot have to purchase the game themselves on release day. Happens less with big budget games, since they are often cushioned by months of positive preview coveragenote Negative preview coverage is rarer in video games because publishers have more methods of controlling the message than movies do, due to the difference in mediums that have convinced many to preorder the game before reviews are even a factor.\nTelevision is also an area where this occurs - preview DVDs (formerly tapes) are sent to reviewers so they can write their reviews. Where this does not occur, it is for three reasons:\nThe number of preview DVDs being sent out is also slowly decreasing overall, as studios have finally realized where all those pre-theatrical-release DVD rips of blockbusters floating around the internet actually come from. However, this doesn't mean previews stop being sent altogether, just that fewer reviewers are trusted with copies. TV networks also screen their programs over the internet on password-protected sites for critics, although this can also be discouraging (any television critic can tell you that they'd rather do anything else than watch a program on the infamously glitchy ABC MediaNet site).\nOf course, on the other hand, small press, indie and underground works usually don't send out review copies, as they tend to be much less concerned with promotion or mainstream opinion; most big name news sources don't care much to review obscure works anyway.\nCompare It's Not Supposed to Win Oscars.\n",
        "example": " All Eyez On Me wasn't screened for critics prior to it's release, worrying fans of Tupac Shakur that the film wouldn't do the iconic, but controversial rapper justice. Come release, while the cast was praised, and most audiences were receptive to the film, it garnered largely negative reviews, mostly stemming from it's many historical innacuracies about Shakur's life  something his childhood friend Jada Pinkett Smith took personal issue with.\n",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/PennyArcade_critics_cropped_6244.png"
    }
]