[
    {
        "trope_id": "t13015",
        "ratio": 6.0,
        "trope": "LiveActionAdaptation",
        "description": "\nIn the West, many animated series have to run against the Animation Age Ghetto; one way to get around this and attract a wider audience is to do a live-action version of something originally animated. Even if it utilizes CG and special effects, this will sometimes strip the show of its perceived \"cartoonishness\". This is also a common device when a live-action movie adaptation is made, which will already be accused of leeching ideas from an older show.\nDepending on how the adaptation is done, it may be successful. However, some suffer from Conspicuous CG and end up the film equivalent of a Porting Disaster.\nA noticeable example is the Super Hero genre, where the outlandish, colorful nature of the genre seems most fitted for animated form. Yet despite animation gaining a bit more respect nowadays, most theatrical adaptations of superheroes are live-action, with varying levels of success.\nOne thing that has dramatically changed since the CGI creation of dinosaurs in Jurassic Park is the ability to visualize things that would have only been realistically possible in animation, such as Humongous Mecha.\nContrast Animated Adaptation.\n",
        "example": " The Fairly OddParents!  A Fairly Odd Movie: Grow Up, Timmy Turner!. Starring Drake Bell as a twenty-three-year-old Timmy Turner still in the fifth grade; he still has his fairies due to acting like a kid since if he does, he gets to keep them. However, Timmy winds up falling in love with a beautiful, twenty-three-year-old Tootie, who threatens to break them apart since it's a rather adult thing for which fairies aren't needed. The movie was so popular that it got two sequelsone about Christmas summer vacation and the other about summer vacation, except it ends up with Timmy becoming a fairy at the end. This was yet another in a long line of attempts to bring an end to the series.\n",
        "img_url": "https://mediaproxy.tvtropes.org/width/1200/https://static.tvtropes.org/pmwiki/pub/images/runaways_hulu.png"
    },
    {
        "trope_id": "t23544",
        "ratio": 5.0,
        "trope": "TheSwarm",
        "description": "What's worse than one big man-eating monster?\nA whole hell of a lot of little ones.\nWith monsters, bigger is not always better. Sometimes tiny can be terrifying if you have overwhelming numbers working for you. Nature has plenty of examples of this and many of them have found their way into the movies. Swarming bees, ants, locusts, piranha, etc. have all frightened moviegoers. Sci-Fi and Horror have added swarming terrors that go beyond things found in the back yard.\nThe promise of nanotechnology also has a dark side. Microscopic machines rampaging across the countryside disassembling everything they encounter in their quest for raw materials with which to bolster their numbers is the latest paranoid fantasy. Alien creatures brought back to Earth because they were tiny and thought safe can multiply at prodigious rates to become a ravening horde consuming everything in their path.\nThe Swarm can also ramp up the horror by having the tiny critters invade the bodies of their victims through any convenient orifice so the victim can be consumed from the inside out.\nSome variants of this trope, namely Bee Afraid, Spider Swarm and Swarm of Rats, have their own pages.\nSometimes overlaps with Hive Mind if all the swarm share one mind. Alternately a Mind Hive controlled swarm serve as Animal Eye Spies to one external controller. If they take a humanoid form, they could be The Worm That Walks. Tactics typically take the form of the Zerg Rush. Often found in a Hornet Hole. When they are aliens then its also a Horde of Alien Locusts. When a swarm's sudden appearance frightens characters and audience, yet turns out to be harmless, it's a Bat Scare. If the horde consists of Nanomachines, then it's Grey Goo.\nNot to be confused with The Swarm, which does feature a swarm of killer bees.\n",
        "example": " Batman Begins:\n The Scarecrow and his fear toxin. In several induced hallucinations, the victim sees worms crawling out of the Scarecrow's eyes and mouth.\n In the same film, the bats summoned by Batman to provide cover against Scarecrow's goons and the police for him to get Rachel out of Arkham.\n",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/the_eighth_plague_locusts.png"
    },
    {
        "trope_id": "t15712",
        "ratio": 2.0,
        "trope": "NotScreenedForCritics",
        "description": "\nSo it's Friday, and you're considering seeing this new movie that has just Opened In Theaters Everywhere. Before you do, you grab a copy of today's newspaper, and turn to the movie section, looking for a review. Or you check a site like Rotten Tomatoes or Metacritic to get both their combined metascore and the reviews that come with it.\nInstead of a review, you read a notice stating that the film was \"not screened for critics.\" The review compilation sites also have very few reviews and can't compute a review score from it. This is almost always a big warning sign about the quality of the movie. For the vast majority of movies that do this, they suspect that under normal circumstances, the reviewers would have seen the film already on DVD \"screeners\" or private showings, and would have had plenty of time to write witty, biting criticism (or just plain vituperation) that would have completely eviscerated it. The general indication is that the studio doesn't want people to be warned away from the movie prior to opening day.\nAnother tactic by studios is to allow critics to see a preview screening... with a bunch of contest winners, so that instead of being able to make notes and review a film in a quiet theater or purpose-built screening room, the critic has to do it in a crowded megaplex with people who probably wouldn't have seen the movie at all if they hadn't won free tickets and will probably like it only because they didn't have to pay to see it. Films aimed at kids and teenagers might get a rowdy and rambunctious audience throughout the entire film (worse if it features the Teen Idol of the moment). One of the actors or producers may even make a \"surprise\" personal appearance, taking away any sense of a neutral setting (are you going to tell them their film is awful in person?). Many critics thus will easily not take the bait and stay away in droves for their sanity.\nThis tends to happen a lot during the months of January, February, and late August - the traditional Dump Months where all the movies in which the studio no longer has faith but which it is contractually obligated to release get dumped, leaving the good months for Summer Blockbusters and Oscar Bait.\nThis happens with video games as well; most prominent review outlets tend to get copies of games early, and it's telling what the publisher thinks of a game if a website like IGN or Gamespot have to purchase the game themselves on release day. Happens less with big budget games, since they are often cushioned by months of positive preview coveragenote Negative preview coverage is rarer in video games because publishers have more methods of controlling the message than movies do, due to the difference in mediums that have convinced many to preorder the game before reviews are even a factor.\nTelevision is also an area where this occurs - preview DVDs (formerly tapes) are sent to reviewers so they can write their reviews. Where this does not occur, it is for three reasons:\nThe number of preview DVDs being sent out is also slowly decreasing overall, as studios have finally realized where all those pre-theatrical-release DVD rips of blockbusters floating around the internet actually come from. However, this doesn't mean previews stop being sent altogether, just that fewer reviewers are trusted with copies. TV networks also screen their programs over the internet on password-protected sites for critics, although this can also be discouraging (any television critic can tell you that they'd rather do anything else than watch a program on the infamously glitchy ABC MediaNet site).\nOf course, on the other hand, small press, indie and underground works usually don't send out review copies, as they tend to be much less concerned with promotion or mainstream opinion; most big name news sources don't care much to review obscure works anyway.\nCompare It's Not Supposed to Win Oscars.\n",
        "example": " All Eyez On Me wasn't screened for critics prior to it's release, worrying fans of Tupac Shakur that the film wouldn't do the iconic, but controversial rapper justice. Come release, while the cast was praised, and most audiences were receptive to the film, it garnered largely negative reviews, mostly stemming from it's many historical innacuracies about Shakur's life  something his childhood friend Jada Pinkett Smith took personal issue with.\n",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/PennyArcade_critics_cropped_6244.png"
    },
    {
        "trope_id": "t17875",
        "ratio": 2.0,
        "trope": "PsychicPowers",
        "description": "\nThe ability to alter (or remotely observe) reality, directly tied to the mind\/brain of the character. This is a specific form of Magic by Any Other Name, where the magic is named for some pseudoscientifical relationship with the caster's mental powers. Psychic, Psion, Mentalic, Mentalist, Parapsychologist, there's dozens of names for these people whose minds are able to sense and\/or manipulate reality on a level that has yet to be proven to exist in Real Life.\nTheir powers are supernatural, but the names are (often) scientifically based, making it useful for Science Fiction stories across the spectrum. In general, the more powerful and dramatic the psychic, the softer the science. Creators may try to build Minovsky Physics for their psychic abilities, usually by detailing brainwaves and electroencephalogramsnote electric brain graph (also known as an EEG). Linking brainwave activity to the psychic abilities can reduce or eliminate use of No Conservation of Energy, which is otherwise part of the standard interpretation of psychic powers. The presence of psychics is accepted in a broad range of Speculative Fiction situations, not just sci-fi storytelling. Any genre may borrow a few psychics without being considered \"too sci-fi\", including otherwise realistic Slice of Life stories, implying its presence in Real Life as well.\nPsychic abilities can be generalized into two categories; receptive and projective. The Parapsychological Association divides them into psi-gamma and psi-kappa. Receptive abilities are purely internal, displaying no external evidence they're being used apart from the occasional Psychic Nosebleed (and of course, the stance). The ability to see the future is receptive; the character gains knowledge with no external mechanic. Projective abilities affect the external world, requiring acting or special effects to reflect the way these abilities manipulate reality. The ability to move physical objects is projective; the character affects an external object with no tangible connection between them. Naturally there is overlap; Telepathy is receptive in that the character gains knowledge from another's mind, and usually projective by allowing the character to implant thoughts\/ideas into the other character as well. For a full list of psychic powers, read the Analysis subpage.\nAlthough psychic abilities are Magic by Any Other Name, they can also exist alongside other types of \"magic\", with some sort of division between two styles of Functional Magic. Even a work with only psychic \"magic\" may have more than one category of psychic abilities, which leads to Unequal Rites; characters with psychic abilities are prejudiced against each other based on their training philosophy, which powers they have access to, and\/or how the powers were gained. Many psychic abilities can also be replicated by sufficiently advanced technology. Characters may be divided on if psychic abilities are scientific, or if psychic abilities are fantastical elements in an otherwise realistic setting (despite said \"realistic\" setting possibly containing werewolves and fairies).\n",
        "example": " One of the students at South Harmon wants to major in Mental Detonation. To everyone's surprise, he apparently makes a car explode during a credits gag ( Incidentally, said car also belonged to the dean of the rival school who tried to have Bartleby's school invalidated ).",
        "img_url": "https://static.tvtropes.org/pmwiki/pub/images/rsz__-second-sight-pc-__3051.jpg"
    },
    {
        "trope_id": "t10542",
        "ratio": 1.5,
        "trope": "HorrorDoesntSettleForSimpleTuesday",
        "description": "It goes like this: You and your friends are having a nice Easter party, when suddenly a deranged killer in a bunny mask starts stalking you. On April Fools Day, that guy you and your friends pulled a rather nasty prank upon is out to get you. On Halloween, the dead rise from their graves and start to terrorize the neighborhood. And on Christmas, The Anti-Christ decides to be born.\n\"Oh, for Pete's sake!\" you exclaim; \"Couldn't these things happen on any other day, like, Tuesday?\"\nSorry pal, Horror Doesn't Settle for Simple Tuesday.\nWhen the horror happens, it tends to happen on holidays and other special days marked on your calendar for various reasons: Lots of people tend to gather around on those days (usually at a remote location), calendar days make nice titles, and nothing quite says Subverted Innocence like (for example) Santa Claus killing people with an axe.\nAlso, remember, some days are sacred to pagan\/occult religions and so \"natural\" choices for supernatural events. These days may have had Christian and\/or commercial holidays added, or they may just be special to the pagans\/witches\/Satanists\/whoever, still not just Tuesday, even if the hero doesn't know this at first. Granted, if you consider all cultures, faiths and customs, every day on the calendar is bound to be a holiday to someone; this trope only applies when that holiday is specifically referenced in the work.\nAnd of course, Lovecraftian unspeakable horrors don't have any use for the human calendar, so they won't bother to do the timezone math to see where to appear. They only care the stars are right on THEIR calendars and none of these calendars have Tuesday!\nPopular trope among horror movies (especially in Slasher Movie genre), but not necessarily limited to them.\nSee also Attack of the Town Festival, Regularly Scheduled Evil, Twisted Christmas, Dangerous 16th Birthday and various holiday episodes. Did I Mention It's Christmas? (or any other holiday) may be in effect for some of these. Contrast But for Me, It Was Tuesday, although the name of that trope might have inspired this one's, as in, the difference between something evil one does every day and the kind reserved for specific days.\n\n\n\n\n\n\n\n\n",
        "example": " Aliens attack on Thanksgiving.",
        "img_url": "https://mediaproxy.tvtropes.org/width/1200/https://static.tvtropes.org/pmwiki/pub/images/holidayhorrormovies_2.png"
    }
]